


* Part 1 

248447920 to low
252052080

#+BEGIN_SRC python :results output :session part2
  
puzzleInput = list(map((lambda line : line.strip()), open("./day7.txt", "r").readlines()))

cardValues = {"A":14, "K":13, "Q":12, "J":1, "T":10, "9":9, "8":8, "7":7, "6":6, "5":5, "4":4, "3":3, "2":2}

class camelHand:

    def __init__(self, handBid, rank=0):
        self.hand = handBid[0]
        self.bid = int(handBid[1])
        self.rank = rank

        self.handDict = {}
        for i in self.hand:
            if i in self.handDict.keys():
              self.handDict[i] += 1
            else:
              self.handDict[i] = 1

        self.values = list(self.handDict.values())
 
        self.handType = self.checkFiveKind() 
        self.handType = self.calcHandwithJokers()

        self.secondary = self.getSecondOrder()
        self.prime_value = (self.handType * 10000000000) + self.secondary

 

    def __str__(self):
        if self.rank:
            return f'Hand: {self.hand}, Bid: {self.bid}, Hand Type: {self.handType}, Rank: {self.rank}'
        return f'Hand: {self.hand}, Bid: {self.bid}, Hand Type: {self.handType}, Prime_value: {self.prime_value}'

    def checkFiveKind(self):     
        if len(self.handDict) == 1:
        #    print("is 5 of a kind")
            return 7
        return self.checkFourKind()

    def checkFourKind(self):
        if 4 in self.values:
        #    print("is 4 of a kind")
            return 6
        return self.checkFullHouse()
        
    def checkFullHouse(self):
        if (len(self.handDict) == 2) and (3 in self.values):
        #    print("is full house")
            return 5
        return self.checkThreeOfAKind()

    def checkThreeOfAKind(self):
        if 3 in self.values:
        #    print("is 3 of kind")
            return 4
        return self.checkTwoPair()

    def checkTwoPair(self):
        if (len(self.handDict) == 3) and (2 in self.values):
        #    print("is two pair")
            return 3
        return self.checkOnePair()

    def checkOnePair(self):
        if 2 in self.values:
        #    print("is one pair")
            return 2
        else:
            return 1

    def getSecondOrder(self):
        secValue = 0
        count = 5
        decimalPlace = 100000000
        for i in self.hand:
            secValue += ((decimalPlace) * cardValues[i])
            count -= 1
            decimalPlace = int(decimalPlace / 100)
        return secValue

    def __lt__(self, other):
        return self.prime_value < other.prime_value

    def calcWinnings(self):
        return self.rank * self.bid

    def calcHandwithJokers(self):
        if "J" not in self.hand:
            return self.checkFiveKind()

        # handType 7 - 5 of a kind
        # handType 6 - 4 of a kind
        # handType 5 - full house
        # handType 4 - 3 of a kind
        # handType 3 - two pair
        # handType 2 - one pair
        # handType 1 - high card

        elif self.handType == 1:
            return 2
        elif self.handType == 2:
            return 4
        elif self.handType == 3:
            if self.handDict["J"] == 2:
                return 6
            else:
                return 5
        elif self.handType == 4:
            return 6
        elif self.handType == 5:
            return 7
        elif self.handType == 6:
            return 7
        else:
            return 7




            
gameLen = len(puzzleInput)

handBids = [camelHand(i.split(" ")) for i in puzzleInput]
handBids.sort()


def calcWinnings(allHands):
    totalWinnings = 0
    count = 1

    for handInfo in allHands:
        handInfo.rank = count
        winnings = handInfo.calcWinnings()
        print(handInfo)
        print(" Winnings: {}".format(winnings))
        totalWinnings += handInfo.calcWinnings()
        count += 1
    return totalWinnings

print(calcWinnings(handBids))

#+END_SRC

#+RESULTS:
#+begin_example
Hand: 248QK, Bid: 847, Hand Type: 1, Rank: 1
 Winnings: 847
Hand: 24K86, Bid: 244, Hand Type: 1, Rank: 2
 Winnings: 488
Hand: 2586Q, Bid: 157, Hand Type: 1, Rank: 3
 Winnings: 471
Hand: 267Q4, Bid: 9, Hand Type: 1, Rank: 4
 Winnings: 36
Hand: 2748K, Bid: 241, Hand Type: 1, Rank: 5
 Winnings: 1205
Hand: 2754Q, Bid: 685, Hand Type: 1, Rank: 6
 Winnings: 4110
Hand: 2835K, Bid: 662, Hand Type: 1, Rank: 7
 Winnings: 4634
Hand: 2T3A8, Bid: 562, Hand Type: 1, Rank: 8
 Winnings: 4496
Hand: 2KT54, Bid: 217, Hand Type: 1, Rank: 9
 Winnings: 1953
Hand: 327A9, Bid: 243, Hand Type: 1, Rank: 10
 Winnings: 2430
Hand: 342TA, Bid: 62, Hand Type: 1, Rank: 11
 Winnings: 682
Hand: 34Q92, Bid: 641, Hand Type: 1, Rank: 12
 Winnings: 7692
Hand: 35TQA, Bid: 6, Hand Type: 1, Rank: 13
 Winnings: 78
Hand: 36T95, Bid: 193, Hand Type: 1, Rank: 14
 Winnings: 2702
Hand: 36QT5, Bid: 724, Hand Type: 1, Rank: 15
 Winnings: 10860
Hand: 37968, Bid: 834, Hand Type: 1, Rank: 16
 Winnings: 13344
Hand: 3856Q, Bid: 539, Hand Type: 1, Rank: 17
 Winnings: 9163
Hand: 386QK, Bid: 722, Hand Type: 1, Rank: 18
 Winnings: 12996
Hand: 398K5, Bid: 618, Hand Type: 1, Rank: 19
 Winnings: 11742
Hand: 39Q26, Bid: 247, Hand Type: 1, Rank: 20
 Winnings: 4940
Hand: 3TA6Q, Bid: 133, Hand Type: 1, Rank: 21
 Winnings: 2793
Hand: 3Q74K, Bid: 555, Hand Type: 1, Rank: 22
 Winnings: 12210
Hand: 3K8TA, Bid: 952, Hand Type: 1, Rank: 23
 Winnings: 21896
Hand: 42Q6T, Bid: 396, Hand Type: 1, Rank: 24
 Winnings: 9504
Hand: 43Q6K, Bid: 91, Hand Type: 1, Rank: 25
 Winnings: 2275
Hand: 49K5T, Bid: 301, Hand Type: 1, Rank: 26
 Winnings: 7826
Hand: 4Q962, Bid: 671, Hand Type: 1, Rank: 27
 Winnings: 18117
Hand: 4A65T, Bid: 115, Hand Type: 1, Rank: 28
 Winnings: 3220
Hand: 5384A, Bid: 924, Hand Type: 1, Rank: 29
 Winnings: 26796
Hand: 542K6, Bid: 397, Hand Type: 1, Rank: 30
 Winnings: 11910
Hand: 563T8, Bid: 50, Hand Type: 1, Rank: 31
 Winnings: 1550
Hand: 5679Q, Bid: 129, Hand Type: 1, Rank: 32
 Winnings: 4128
Hand: 578QA, Bid: 337, Hand Type: 1, Rank: 33
 Winnings: 11121
Hand: 57A9Q, Bid: 665, Hand Type: 1, Rank: 34
 Winnings: 22610
Hand: 589Q4, Bid: 688, Hand Type: 1, Rank: 35
 Winnings: 24080
Hand: 596K7, Bid: 566, Hand Type: 1, Rank: 36
 Winnings: 20376
Hand: 59Q23, Bid: 522, Hand Type: 1, Rank: 37
 Winnings: 19314
Hand: 5Q963, Bid: 816, Hand Type: 1, Rank: 38
 Winnings: 31008
Hand: 5AQ6T, Bid: 503, Hand Type: 1, Rank: 39
 Winnings: 19617
Hand: 6295A, Bid: 226, Hand Type: 1, Rank: 40
 Winnings: 9040
Hand: 6429A, Bid: 922, Hand Type: 1, Rank: 41
 Winnings: 37802
Hand: 64A57, Bid: 583, Hand Type: 1, Rank: 42
 Winnings: 24486
Hand: 654Q8, Bid: 888, Hand Type: 1, Rank: 43
 Winnings: 38184
Hand: 6598K, Bid: 910, Hand Type: 1, Rank: 44
 Winnings: 40040
Hand: 65A9K, Bid: 842, Hand Type: 1, Rank: 45
 Winnings: 37890
Hand: 678QA, Bid: 388, Hand Type: 1, Rank: 46
 Winnings: 17848
Hand: 684TA, Bid: 970, Hand Type: 1, Rank: 47
 Winnings: 45590
Hand: 698QA, Bid: 573, Hand Type: 1, Rank: 48
 Winnings: 27504
Hand: 72689, Bid: 353, Hand Type: 1, Rank: 49
 Winnings: 17297
Hand: 72KQ3, Bid: 826, Hand Type: 1, Rank: 50
 Winnings: 41300
Hand: 765Q2, Bid: 521, Hand Type: 1, Rank: 51
 Winnings: 26571
Hand: 769T4, Bid: 120, Hand Type: 1, Rank: 52
 Winnings: 6240
Hand: 793K4, Bid: 256, Hand Type: 1, Rank: 53
 Winnings: 13568
Hand: 79A56, Bid: 471, Hand Type: 1, Rank: 54
 Winnings: 25434
Hand: 7T543, Bid: 131, Hand Type: 1, Rank: 55
 Winnings: 7205
Hand: 7K42T, Bid: 594, Hand Type: 1, Rank: 56
 Winnings: 33264
Hand: 7K468, Bid: 116, Hand Type: 1, Rank: 57
 Winnings: 6612
Hand: 7K6Q8, Bid: 40, Hand Type: 1, Rank: 58
 Winnings: 2320
Hand: 7AT65, Bid: 723, Hand Type: 1, Rank: 59
 Winnings: 42657
Hand: 824T6, Bid: 496, Hand Type: 1, Rank: 60
 Winnings: 29760
Hand: 82597, Bid: 890, Hand Type: 1, Rank: 61
 Winnings: 54290
Hand: 82936, Bid: 584, Hand Type: 1, Rank: 62
 Winnings: 36208
Hand: 83657, Bid: 892, Hand Type: 1, Rank: 63
 Winnings: 56196
Hand: 86439, Bid: 66, Hand Type: 1, Rank: 64
 Winnings: 4224
Hand: 8T5QA, Bid: 848, Hand Type: 1, Rank: 65
 Winnings: 55120
Hand: 8Q93T, Bid: 825, Hand Type: 1, Rank: 66
 Winnings: 54450
Hand: 8K6T4, Bid: 33, Hand Type: 1, Rank: 67
 Winnings: 2211
Hand: 96TA2, Bid: 706, Hand Type: 1, Rank: 68
 Winnings: 48008
Hand: 98563, Bid: 113, Hand Type: 1, Rank: 69
 Winnings: 7797
Hand: 9T4QK, Bid: 669, Hand Type: 1, Rank: 70
 Winnings: 46830
Hand: 9T6Q3, Bid: 413, Hand Type: 1, Rank: 71
 Winnings: 29323
Hand: 9Q538, Bid: 414, Hand Type: 1, Rank: 72
 Winnings: 29808
Hand: 9K523, Bid: 727, Hand Type: 1, Rank: 73
 Winnings: 53071
Hand: 9K7T5, Bid: 119, Hand Type: 1, Rank: 74
 Winnings: 8806
Hand: 9A3K5, Bid: 760, Hand Type: 1, Rank: 75
 Winnings: 57000
Hand: T257A, Bid: 556, Hand Type: 1, Rank: 76
 Winnings: 42256
Hand: T4Q67, Bid: 220, Hand Type: 1, Rank: 77
 Winnings: 16940
Hand: T549Q, Bid: 434, Hand Type: 1, Rank: 78
 Winnings: 33852
Hand: T725Q, Bid: 358, Hand Type: 1, Rank: 79
 Winnings: 28282
Hand: T7982, Bid: 5, Hand Type: 1, Rank: 80
 Winnings: 400
Hand: T7A2Q, Bid: 149, Hand Type: 1, Rank: 81
 Winnings: 12069
Hand: TQ2K3, Bid: 492, Hand Type: 1, Rank: 82
 Winnings: 40344
Hand: TK498, Bid: 48, Hand Type: 1, Rank: 83
 Winnings: 3984
Hand: Q2497, Bid: 264, Hand Type: 1, Rank: 84
 Winnings: 22176
Hand: Q3285, Bid: 257, Hand Type: 1, Rank: 85
 Winnings: 21845
Hand: Q4A9K, Bid: 324, Hand Type: 1, Rank: 86
 Winnings: 27864
Hand: Q68A3, Bid: 479, Hand Type: 1, Rank: 87
 Winnings: 41673
Hand: Q6KT7, Bid: 820, Hand Type: 1, Rank: 88
 Winnings: 72160
Hand: Q7925, Bid: 117, Hand Type: 1, Rank: 89
 Winnings: 10413
Hand: Q7985, Bid: 718, Hand Type: 1, Rank: 90
 Winnings: 64620
Hand: Q92K5, Bid: 469, Hand Type: 1, Rank: 91
 Winnings: 42679
Hand: K253A, Bid: 971, Hand Type: 1, Rank: 92
 Winnings: 89332
Hand: K62Q9, Bid: 773, Hand Type: 1, Rank: 93
 Winnings: 71889
Hand: K67T8, Bid: 197, Hand Type: 1, Rank: 94
 Winnings: 18518
Hand: K8243, Bid: 923, Hand Type: 1, Rank: 95
 Winnings: 87685
Hand: K8QA7, Bid: 373, Hand Type: 1, Rank: 96
 Winnings: 35808
Hand: K93QA, Bid: 311, Hand Type: 1, Rank: 97
 Winnings: 30167
Hand: K9AT3, Bid: 859, Hand Type: 1, Rank: 98
 Winnings: 84182
Hand: KQ549, Bid: 473, Hand Type: 1, Rank: 99
 Winnings: 46827
Hand: KA832, Bid: 578, Hand Type: 1, Rank: 100
 Winnings: 57800
Hand: A3479, Bid: 107, Hand Type: 1, Rank: 101
 Winnings: 10807
Hand: A364K, Bid: 592, Hand Type: 1, Rank: 102
 Winnings: 60384
Hand: A7298, Bid: 811, Hand Type: 1, Rank: 103
 Winnings: 83533
Hand: A7K25, Bid: 790, Hand Type: 1, Rank: 104
 Winnings: 82160
Hand: A9T28, Bid: 633, Hand Type: 1, Rank: 105
 Winnings: 66465
Hand: AT98K, Bid: 628, Hand Type: 1, Rank: 106
 Winnings: 66568
Hand: ATQ32, Bid: 171, Hand Type: 1, Rank: 107
 Winnings: 18297
Hand: ATK69, Bid: 249, Hand Type: 1, Rank: 108
 Winnings: 26892
Hand: ATK7Q, Bid: 185, Hand Type: 1, Rank: 109
 Winnings: 20165
Hand: AQ382, Bid: 10, Hand Type: 1, Rank: 110
 Winnings: 1100
Hand: AQ52K, Bid: 194, Hand Type: 1, Rank: 111
 Winnings: 21534
Hand: AQ829, Bid: 830, Hand Type: 1, Rank: 112
 Winnings: 92960
Hand: J375Q, Bid: 873, Hand Type: 2, Rank: 113
 Winnings: 98649
Hand: J423Q, Bid: 289, Hand Type: 2, Rank: 114
 Winnings: 32946
Hand: J4896, Bid: 531, Hand Type: 2, Rank: 115
 Winnings: 61065
Hand: J5392, Bid: 537, Hand Type: 2, Rank: 116
 Winnings: 62292
Hand: J6T42, Bid: 529, Hand Type: 2, Rank: 117
 Winnings: 61893
Hand: JT4A2, Bid: 950, Hand Type: 2, Rank: 118
 Winnings: 112100
Hand: JTK34, Bid: 365, Hand Type: 2, Rank: 119
 Winnings: 43435
Hand: JK47Q, Bid: 968, Hand Type: 2, Rank: 120
 Winnings: 116160
Hand: JKQ96, Bid: 696, Hand Type: 2, Rank: 121
 Winnings: 84216
Hand: JA5TK, Bid: 125, Hand Type: 2, Rank: 122
 Winnings: 15250
Hand: JA734, Bid: 443, Hand Type: 2, Rank: 123
 Winnings: 54489
Hand: JA859, Bid: 21, Hand Type: 2, Rank: 124
 Winnings: 2604
Hand: JATQ7, Bid: 468, Hand Type: 2, Rank: 125
 Winnings: 58500
Hand: 2JQ4A, Bid: 480, Hand Type: 2, Rank: 126
 Winnings: 60480
Hand: 229Q5, Bid: 761, Hand Type: 2, Rank: 127
 Winnings: 96647
Hand: 2334T, Bid: 664, Hand Type: 2, Rank: 128
 Winnings: 84992
Hand: 23593, Bid: 608, Hand Type: 2, Rank: 129
 Winnings: 78432
Hand: 24A64, Bid: 561, Hand Type: 2, Rank: 130
 Winnings: 72930
Hand: 25Q42, Bid: 659, Hand Type: 2, Rank: 131
 Winnings: 86329
Hand: 25K5T, Bid: 401, Hand Type: 2, Rank: 132
 Winnings: 52932
Hand: 26855, Bid: 462, Hand Type: 2, Rank: 133
 Winnings: 61446
Hand: 27KTT, Bid: 973, Hand Type: 2, Rank: 134
 Winnings: 130382
Hand: 27AA8, Bid: 17, Hand Type: 2, Rank: 135
 Winnings: 2295
Hand: 28744, Bid: 164, Hand Type: 2, Rank: 136
 Winnings: 22304
Hand: 28966, Bid: 921, Hand Type: 2, Rank: 137
 Winnings: 126177
Hand: 28AK8, Bid: 235, Hand Type: 2, Rank: 138
 Winnings: 32430
Hand: 29JA8, Bid: 159, Hand Type: 2, Rank: 139
 Winnings: 22101
Hand: 2T5KK, Bid: 298, Hand Type: 2, Rank: 140
 Winnings: 41720
Hand: 2Q382, Bid: 620, Hand Type: 2, Rank: 141
 Winnings: 87420
Hand: 2Q8AQ, Bid: 942, Hand Type: 2, Rank: 142
 Winnings: 133764
Hand: 2QTT9, Bid: 542, Hand Type: 2, Rank: 143
 Winnings: 77506
Hand: 2KTT5, Bid: 147, Hand Type: 2, Rank: 144
 Winnings: 21168
Hand: 2AQQ4, Bid: 269, Hand Type: 2, Rank: 145
 Winnings: 39005
Hand: 3J8A6, Bid: 958, Hand Type: 2, Rank: 146
 Winnings: 139868
Hand: 3277A, Bid: 28, Hand Type: 2, Rank: 147
 Winnings: 4116
Hand: 343Q7, Bid: 406, Hand Type: 2, Rank: 148
 Winnings: 60088
Hand: 34TTA, Bid: 679, Hand Type: 2, Rank: 149
 Winnings: 101171
Hand: 37KQQ, Bid: 714, Hand Type: 2, Rank: 150
 Winnings: 107100
Hand: 38J2K, Bid: 36, Hand Type: 2, Rank: 151
 Winnings: 5436
Hand: 3835K, Bid: 502, Hand Type: 2, Rank: 152
 Winnings: 76304
Hand: 38QJA, Bid: 57, Hand Type: 2, Rank: 153
 Winnings: 8721
Hand: 39327, Bid: 390, Hand Type: 2, Rank: 154
 Winnings: 60060
Hand: 398J7, Bid: 137, Hand Type: 2, Rank: 155
 Winnings: 21235
Hand: 39A69, Bid: 90, Hand Type: 2, Rank: 156
 Winnings: 14040
Hand: 3TA9A, Bid: 460, Hand Type: 2, Rank: 157
 Winnings: 72220
Hand: 3Q397, Bid: 619, Hand Type: 2, Rank: 158
 Winnings: 97802
Hand: 3QAJ4, Bid: 347, Hand Type: 2, Rank: 159
 Winnings: 55173
Hand: 3K693, Bid: 585, Hand Type: 2, Rank: 160
 Winnings: 93600
Hand: 4J58Q, Bid: 680, Hand Type: 2, Rank: 161
 Winnings: 109480
Hand: 422TK, Bid: 768, Hand Type: 2, Rank: 162
 Winnings: 124416
Hand: 42643, Bid: 364, Hand Type: 2, Rank: 163
 Winnings: 59332
Hand: 42A7A, Bid: 80, Hand Type: 2, Rank: 164
 Winnings: 13120
Hand: 432KK, Bid: 726, Hand Type: 2, Rank: 165
 Winnings: 119790
Hand: 44T75, Bid: 642, Hand Type: 2, Rank: 166
 Winnings: 106572
Hand: 46JT7, Bid: 42, Hand Type: 2, Rank: 167
 Winnings: 7014
Hand: 462QJ, Bid: 112, Hand Type: 2, Rank: 168
 Winnings: 18816
Hand: 46TQQ, Bid: 497, Hand Type: 2, Rank: 169
 Winnings: 83993
Hand: 47JK9, Bid: 785, Hand Type: 2, Rank: 170
 Winnings: 133450
Hand: 4754K, Bid: 177, Hand Type: 2, Rank: 171
 Winnings: 30267
Hand: 486A6, Bid: 978, Hand Type: 2, Rank: 172
 Winnings: 168216
Hand: 48TT6, Bid: 780, Hand Type: 2, Rank: 173
 Winnings: 134940
Hand: 48AJT, Bid: 507, Hand Type: 2, Rank: 174
 Winnings: 88218
Hand: 4T525, Bid: 974, Hand Type: 2, Rank: 175
 Winnings: 170450
Hand: 4Q3J6, Bid: 953, Hand Type: 2, Rank: 176
 Winnings: 167728
Hand: 4Q479, Bid: 431, Hand Type: 2, Rank: 177
 Winnings: 76287
Hand: 4QKJ6, Bid: 508, Hand Type: 2, Rank: 178
 Winnings: 90424
Hand: 54696, Bid: 699, Hand Type: 2, Rank: 179
 Winnings: 125121
Hand: 567AA, Bid: 219, Hand Type: 2, Rank: 180
 Winnings: 39420
Hand: 56A64, Bid: 487, Hand Type: 2, Rank: 181
 Winnings: 88147
Hand: 573Q5, Bid: 934, Hand Type: 2, Rank: 182
 Winnings: 169988
Hand: 5772A, Bid: 206, Hand Type: 2, Rank: 183
 Winnings: 37698
Hand: 57989, Bid: 109, Hand Type: 2, Rank: 184
 Winnings: 20056
Hand: 57TAA, Bid: 891, Hand Type: 2, Rank: 185
 Winnings: 164835
Hand: 59JK6, Bid: 675, Hand Type: 2, Rank: 186
 Winnings: 125550
Hand: 59QQ7, Bid: 939, Hand Type: 2, Rank: 187
 Winnings: 175593
Hand: 5T5KQ, Bid: 805, Hand Type: 2, Rank: 188
 Winnings: 151340
Hand: 5TT28, Bid: 599, Hand Type: 2, Rank: 189
 Winnings: 113211
Hand: 5TK4J, Bid: 506, Hand Type: 2, Rank: 190
 Winnings: 96140
Hand: 5Q5A7, Bid: 132, Hand Type: 2, Rank: 191
 Winnings: 25212
Hand: 5Q82Q, Bid: 988, Hand Type: 2, Rank: 192
 Winnings: 189696
Hand: 5K7K6, Bid: 63, Hand Type: 2, Rank: 193
 Winnings: 12159
Hand: 6J2Q7, Bid: 803, Hand Type: 2, Rank: 194
 Winnings: 155782
Hand: 6J537, Bid: 885, Hand Type: 2, Rank: 195
 Winnings: 172575
Hand: 6J9K3, Bid: 808, Hand Type: 2, Rank: 196
 Winnings: 158368
Hand: 63828, Bid: 489, Hand Type: 2, Rank: 197
 Winnings: 96333
Hand: 668A9, Bid: 227, Hand Type: 2, Rank: 198
 Winnings: 44946
Hand: 6T4Q6, Bid: 856, Hand Type: 2, Rank: 199
 Winnings: 170344
Hand: 6TTQ9, Bid: 990, Hand Type: 2, Rank: 200
 Winnings: 198000
Hand: 6KKQT, Bid: 354, Hand Type: 2, Rank: 201
 Winnings: 71154
Hand: 6A4Q4, Bid: 78, Hand Type: 2, Rank: 202
 Winnings: 15756
Hand: 6AT55, Bid: 689, Hand Type: 2, Rank: 203
 Winnings: 139867
Hand: 6AT62, Bid: 427, Hand Type: 2, Rank: 204
 Winnings: 87108
Hand: 7J3TQ, Bid: 589, Hand Type: 2, Rank: 205
 Winnings: 120745
Hand: 7J64Q, Bid: 871, Hand Type: 2, Rank: 206
 Winnings: 179426
Hand: 7JA65, Bid: 218, Hand Type: 2, Rank: 207
 Winnings: 45126
Hand: 722Q3, Bid: 513, Hand Type: 2, Rank: 208
 Winnings: 106704
Hand: 7423J, Bid: 2, Hand Type: 2, Rank: 209
 Winnings: 418
Hand: 74297, Bid: 851, Hand Type: 2, Rank: 210
 Winnings: 178710
Hand: 743J5, Bid: 292, Hand Type: 2, Rank: 211
 Winnings: 61612
Hand: 7488K, Bid: 175, Hand Type: 2, Rank: 212
 Winnings: 37100
Hand: 75QK5, Bid: 499, Hand Type: 2, Rank: 213
 Winnings: 106287
Hand: 769AJ, Bid: 867, Hand Type: 2, Rank: 214
 Winnings: 185538
Hand: 77T83, Bid: 647, Hand Type: 2, Rank: 215
 Winnings: 139105
Hand: 77K39, Bid: 681, Hand Type: 2, Rank: 216
 Winnings: 147096
Hand: 78Q76, Bid: 548, Hand Type: 2, Rank: 217
 Winnings: 118916
Hand: 78A27, Bid: 766, Hand Type: 2, Rank: 218
 Winnings: 166988
Hand: 795AJ, Bid: 753, Hand Type: 2, Rank: 219
 Winnings: 164907
Hand: 7T994, Bid: 989, Hand Type: 2, Rank: 220
 Winnings: 217580
Hand: 7TAA9, Bid: 687, Hand Type: 2, Rank: 221
 Winnings: 151827
Hand: 7K443, Bid: 601, Hand Type: 2, Rank: 222
 Winnings: 133422
Hand: 7K5TJ, Bid: 845, Hand Type: 2, Rank: 223
 Winnings: 188435
Hand: 7K63J, Bid: 198, Hand Type: 2, Rank: 224
 Winnings: 44352
Hand: 7K79T, Bid: 653, Hand Type: 2, Rank: 225
 Winnings: 146925
Hand: 7AK2K, Bid: 650, Hand Type: 2, Rank: 226
 Winnings: 146900
Hand: 82293, Bid: 224, Hand Type: 2, Rank: 227
 Winnings: 50848
Hand: 833TK, Bid: 380, Hand Type: 2, Rank: 228
 Winnings: 86640
Hand: 84JKA, Bid: 629, Hand Type: 2, Rank: 229
 Winnings: 144041
Hand: 85ATA, Bid: 986, Hand Type: 2, Rank: 230
 Winnings: 226780
Hand: 8863K, Bid: 271, Hand Type: 2, Rank: 231
 Winnings: 62601
Hand: 8955K, Bid: 138, Hand Type: 2, Rank: 232
 Winnings: 32016
Hand: 89747, Bid: 381, Hand Type: 2, Rank: 233
 Winnings: 88773
Hand: 8TJ93, Bid: 155, Hand Type: 2, Rank: 234
 Winnings: 36270
Hand: 8TJA7, Bid: 168, Hand Type: 2, Rank: 235
 Winnings: 39480
Hand: 8KT2J, Bid: 446, Hand Type: 2, Rank: 236
 Winnings: 105256
Hand: 8KQJ4, Bid: 733, Hand Type: 2, Rank: 237
 Winnings: 173721
Hand: 9J2T8, Bid: 255, Hand Type: 2, Rank: 238
 Winnings: 60690
Hand: 9JTK4, Bid: 661, Hand Type: 2, Rank: 239
 Winnings: 157979
Hand: 928J3, Bid: 804, Hand Type: 2, Rank: 240
 Winnings: 192960
Hand: 9334A, Bid: 887, Hand Type: 2, Rank: 241
 Winnings: 213767
Hand: 93763, Bid: 458, Hand Type: 2, Rank: 242
 Winnings: 110836
Hand: 967JQ, Bid: 771, Hand Type: 2, Rank: 243
 Winnings: 187353
Hand: 9747K, Bid: 46, Hand Type: 2, Rank: 244
 Winnings: 11224
Hand: 97655, Bid: 367, Hand Type: 2, Rank: 245
 Winnings: 89915
Hand: 97KJ6, Bid: 524, Hand Type: 2, Rank: 246
 Winnings: 128904
Hand: 98J67, Bid: 907, Hand Type: 2, Rank: 247
 Winnings: 224029
Hand: 984JA, Bid: 624, Hand Type: 2, Rank: 248
 Winnings: 154752
Hand: 98T95, Bid: 716, Hand Type: 2, Rank: 249
 Winnings: 178284
Hand: 9T7T6, Bid: 765, Hand Type: 2, Rank: 250
 Winnings: 191250
Hand: 9TKJ8, Bid: 612, Hand Type: 2, Rank: 251
 Winnings: 153612
Hand: 9TAJ2, Bid: 327, Hand Type: 2, Rank: 252
 Winnings: 82404
Hand: 9Q8TT, Bid: 745, Hand Type: 2, Rank: 253
 Winnings: 188485
Hand: 9KKQ2, Bid: 602, Hand Type: 2, Rank: 254
 Winnings: 152908
Hand: 9KAJ6, Bid: 987, Hand Type: 2, Rank: 255
 Winnings: 251685
Hand: TJ524, Bid: 818, Hand Type: 2, Rank: 256
 Winnings: 209408
Hand: TJ952, Bid: 913, Hand Type: 2, Rank: 257
 Winnings: 234641
Hand: TJQ8A, Bid: 806, Hand Type: 2, Rank: 258
 Winnings: 207948
Hand: T24QQ, Bid: 409, Hand Type: 2, Rank: 259
 Winnings: 105931
Hand: T3JQK, Bid: 637, Hand Type: 2, Rank: 260
 Winnings: 165620
Hand: T398T, Bid: 558, Hand Type: 2, Rank: 261
 Winnings: 145638
Hand: T435T, Bid: 788, Hand Type: 2, Rank: 262
 Winnings: 206456
Hand: T65JK, Bid: 941, Hand Type: 2, Rank: 263
 Winnings: 247483
Hand: T7AJ6, Bid: 204, Hand Type: 2, Rank: 264
 Winnings: 53856
Hand: T8AJ3, Bid: 606, Hand Type: 2, Rank: 265
 Winnings: 160590
Hand: T9596, Bid: 27, Hand Type: 2, Rank: 266
 Winnings: 7182
Hand: T9QQ2, Bid: 376, Hand Type: 2, Rank: 267
 Winnings: 100392
Hand: TK65T, Bid: 559, Hand Type: 2, Rank: 268
 Winnings: 149812
Hand: TA882, Bid: 306, Hand Type: 2, Rank: 269
 Winnings: 82314
Hand: QJ846, Bid: 700, Hand Type: 2, Rank: 270
 Winnings: 189000
Hand: QJ943, Bid: 181, Hand Type: 2, Rank: 271
 Winnings: 49051
Hand: QJK65, Bid: 356, Hand Type: 2, Rank: 272
 Winnings: 96832
Hand: QJAKT, Bid: 145, Hand Type: 2, Rank: 273
 Winnings: 39585
Hand: Q3KJ2, Bid: 29, Hand Type: 2, Rank: 274
 Winnings: 7946
Hand: Q435J, Bid: 20, Hand Type: 2, Rank: 275
 Winnings: 5500
Hand: Q48J3, Bid: 260, Hand Type: 2, Rank: 276
 Winnings: 71760
Hand: Q564Q, Bid: 932, Hand Type: 2, Rank: 277
 Winnings: 258164
Hand: Q5T75, Bid: 444, Hand Type: 2, Rank: 278
 Winnings: 123432
Hand: Q673J, Bid: 697, Hand Type: 2, Rank: 279
 Winnings: 194463
Hand: Q68K6, Bid: 704, Hand Type: 2, Rank: 280
 Winnings: 197120
Hand: Q6K9K, Bid: 266, Hand Type: 2, Rank: 281
 Winnings: 74746
Hand: QTJ87, Bid: 956, Hand Type: 2, Rank: 282
 Winnings: 269592
Hand: QT46J, Bid: 864, Hand Type: 2, Rank: 283
 Winnings: 244512
Hand: QT7J5, Bid: 777, Hand Type: 2, Rank: 284
 Winnings: 220668
Hand: QTQ54, Bid: 549, Hand Type: 2, Rank: 285
 Winnings: 156465
Hand: QK33T, Bid: 52, Hand Type: 2, Rank: 286
 Winnings: 14872
Hand: QK787, Bid: 655, Hand Type: 2, Rank: 287
 Winnings: 187985
Hand: QAKTK, Bid: 139, Hand Type: 2, Rank: 288
 Winnings: 40032
Hand: KJ69T, Bid: 228, Hand Type: 2, Rank: 289
 Winnings: 65892
Hand: KJA53, Bid: 676, Hand Type: 2, Rank: 290
 Winnings: 196040
Hand: K3374, Bid: 908, Hand Type: 2, Rank: 291
 Winnings: 264228
Hand: K3QJ6, Bid: 43, Hand Type: 2, Rank: 292
 Winnings: 12556
Hand: K3K9T, Bid: 336, Hand Type: 2, Rank: 293
 Winnings: 98448
Hand: K3A4J, Bid: 94, Hand Type: 2, Rank: 294
 Winnings: 27636
Hand: K5977, Bid: 754, Hand Type: 2, Rank: 295
 Winnings: 222430
Hand: K63K5, Bid: 636, Hand Type: 2, Rank: 296
 Winnings: 188256
Hand: K66AT, Bid: 565, Hand Type: 2, Rank: 297
 Winnings: 167805
Hand: K7464, Bid: 447, Hand Type: 2, Rank: 298
 Winnings: 133206
Hand: K8892, Bid: 393, Hand Type: 2, Rank: 299
 Winnings: 117507
Hand: K8QK5, Bid: 15, Hand Type: 2, Rank: 300
 Winnings: 4500
Hand: K9T44, Bid: 457, Hand Type: 2, Rank: 301
 Winnings: 137557
Hand: KA6A7, Bid: 8, Hand Type: 2, Rank: 302
 Winnings: 2416
Hand: AJQ3K, Bid: 836, Hand Type: 2, Rank: 303
 Winnings: 253308
Hand: A2868, Bid: 355, Hand Type: 2, Rank: 304
 Winnings: 107920
Hand: A36J9, Bid: 928, Hand Type: 2, Rank: 305
 Winnings: 283040
Hand: A3832, Bid: 165, Hand Type: 2, Rank: 306
 Winnings: 50490
Hand: A4Q4T, Bid: 93, Hand Type: 2, Rank: 307
 Winnings: 28551
Hand: A4A57, Bid: 552, Hand Type: 2, Rank: 308
 Winnings: 170016
Hand: A5AQK, Bid: 104, Hand Type: 2, Rank: 309
 Winnings: 32136
Hand: A64J8, Bid: 385, Hand Type: 2, Rank: 310
 Winnings: 119350
Hand: A64KA, Bid: 89, Hand Type: 2, Rank: 311
 Winnings: 27679
Hand: AT833, Bid: 617, Hand Type: 2, Rank: 312
 Winnings: 192504
Hand: AAT8Q, Bid: 377, Hand Type: 2, Rank: 313
 Winnings: 118001
Hand: 22T44, Bid: 821, Hand Type: 3, Rank: 314
 Winnings: 257794
Hand: 244QQ, Bid: 581, Hand Type: 3, Rank: 315
 Winnings: 183015
Hand: 24884, Bid: 403, Hand Type: 3, Rank: 316
 Winnings: 127348
Hand: 277QQ, Bid: 234, Hand Type: 3, Rank: 317
 Winnings: 74178
Hand: 28K2K, Bid: 563, Hand Type: 3, Rank: 318
 Winnings: 179034
Hand: 2T266, Bid: 927, Hand Type: 3, Rank: 319
 Winnings: 295713
Hand: 2T2TQ, Bid: 99, Hand Type: 3, Rank: 320
 Winnings: 31680
Hand: 2QAA2, Bid: 976, Hand Type: 3, Rank: 321
 Winnings: 313296
Hand: 2A82A, Bid: 25, Hand Type: 3, Rank: 322
 Winnings: 8050
Hand: 33676, Bid: 605, Hand Type: 3, Rank: 323
 Winnings: 195415
Hand: 33882, Bid: 693, Hand Type: 3, Rank: 324
 Winnings: 224532
Hand: 33QTQ, Bid: 657, Hand Type: 3, Rank: 325
 Winnings: 213525
Hand: 35358, Bid: 315, Hand Type: 3, Rank: 326
 Winnings: 102690
Hand: 35435, Bid: 741, Hand Type: 3, Rank: 327
 Winnings: 242307
Hand: 35K35, Bid: 832, Hand Type: 3, Rank: 328
 Winnings: 272896
Hand: 37878, Bid: 930, Hand Type: 3, Rank: 329
 Winnings: 305970
Hand: 37A7A, Bid: 180, Hand Type: 3, Rank: 330
 Winnings: 59400
Hand: 3A223, Bid: 840, Hand Type: 3, Rank: 331
 Winnings: 278040
Hand: 3AA35, Bid: 824, Hand Type: 3, Rank: 332
 Winnings: 273568
Hand: 44TKK, Bid: 179, Hand Type: 3, Rank: 333
 Winnings: 59607
Hand: 44Q22, Bid: 841, Hand Type: 3, Rank: 334
 Winnings: 280894
Hand: 45584, Bid: 124, Hand Type: 3, Rank: 335
 Winnings: 41540
Hand: 46436, Bid: 195, Hand Type: 3, Rank: 336
 Winnings: 65520
Hand: 46A6A, Bid: 979, Hand Type: 3, Rank: 337
 Winnings: 329923
Hand: 474AA, Bid: 546, Hand Type: 3, Rank: 338
 Winnings: 184548
Hand: 47764, Bid: 690, Hand Type: 3, Rank: 339
 Winnings: 233910
Hand: 48864, Bid: 416, Hand Type: 3, Rank: 340
 Winnings: 141440
Hand: 488K4, Bid: 30, Hand Type: 3, Rank: 341
 Winnings: 10230
Hand: 4T4KT, Bid: 368, Hand Type: 3, Rank: 342
 Winnings: 125856
Hand: 4T774, Bid: 999, Hand Type: 3, Rank: 343
 Winnings: 342657
Hand: 4Q2Q2, Bid: 677, Hand Type: 3, Rank: 344
 Winnings: 232888
Hand: 53523, Bid: 359, Hand Type: 3, Rank: 345
 Winnings: 123855
Hand: 554Q4, Bid: 762, Hand Type: 3, Rank: 346
 Winnings: 263652
Hand: 55T22, Bid: 658, Hand Type: 3, Rank: 347
 Winnings: 228326
Hand: 55QTQ, Bid: 95, Hand Type: 3, Rank: 348
 Winnings: 33060
Hand: 55AA3, Bid: 604, Hand Type: 3, Rank: 349
 Winnings: 210796
Hand: 5665Q, Bid: 649, Hand Type: 3, Rank: 350
 Winnings: 227150
Hand: 59956, Bid: 299, Hand Type: 3, Rank: 351
 Winnings: 104949
Hand: 59958, Bid: 705, Hand Type: 3, Rank: 352
 Winnings: 248160
Hand: 5QK5Q, Bid: 411, Hand Type: 3, Rank: 353
 Winnings: 145083
Hand: 5A588, Bid: 67, Hand Type: 3, Rank: 354
 Winnings: 23718
Hand: 65885, Bid: 532, Hand Type: 3, Rank: 355
 Winnings: 188860
Hand: 65886, Bid: 557, Hand Type: 3, Rank: 356
 Winnings: 198292
Hand: 66334, Bid: 191, Hand Type: 3, Rank: 357
 Winnings: 68187
Hand: 669AA, Bid: 485, Hand Type: 3, Rank: 358
 Winnings: 173630
Hand: 67267, Bid: 463, Hand Type: 3, Rank: 359
 Winnings: 166217
Hand: 68226, Bid: 291, Hand Type: 3, Rank: 360
 Winnings: 104760
Hand: 68862, Bid: 270, Hand Type: 3, Rank: 361
 Winnings: 97470
Hand: 69K6K, Bid: 85, Hand Type: 3, Rank: 362
 Winnings: 30770
Hand: 6TT6A, Bid: 464, Hand Type: 3, Rank: 363
 Winnings: 168432
Hand: 72724, Bid: 550, Hand Type: 3, Rank: 364
 Winnings: 200200
Hand: 7272K, Bid: 329, Hand Type: 3, Rank: 365
 Winnings: 120085
Hand: 73344, Bid: 207, Hand Type: 3, Rank: 366
 Winnings: 75762
Hand: 73K3K, Bid: 22, Hand Type: 3, Rank: 367
 Winnings: 8074
Hand: 74488, Bid: 166, Hand Type: 3, Rank: 368
 Winnings: 61088
Hand: 74TT4, Bid: 445, Hand Type: 3, Rank: 369
 Winnings: 164205
Hand: 7667A, Bid: 512, Hand Type: 3, Rank: 370
 Winnings: 189440
Hand: 76868, Bid: 156, Hand Type: 3, Rank: 371
 Winnings: 57876
Hand: 77545, Bid: 231, Hand Type: 3, Rank: 372
 Winnings: 85932
Hand: 78338, Bid: 84, Hand Type: 3, Rank: 373
 Winnings: 31332
Hand: 78847, Bid: 404, Hand Type: 3, Rank: 374
 Winnings: 151096
Hand: 7Q7QT, Bid: 656, Hand Type: 3, Rank: 375
 Winnings: 246000
Hand: 833QQ, Bid: 420, Hand Type: 3, Rank: 376
 Winnings: 157920
Hand: 83668, Bid: 961, Hand Type: 3, Rank: 377
 Winnings: 362297
Hand: 84948, Bid: 192, Hand Type: 3, Rank: 378
 Winnings: 72576
Hand: 85385, Bid: 702, Hand Type: 3, Rank: 379
 Winnings: 266058
Hand: 86T68, Bid: 203, Hand Type: 3, Rank: 380
 Winnings: 77140
Hand: 8787K, Bid: 262, Hand Type: 3, Rank: 381
 Winnings: 99822
Hand: 88445, Bid: 947, Hand Type: 3, Rank: 382
 Winnings: 361754
Hand: 88A9A, Bid: 880, Hand Type: 3, Rank: 383
 Winnings: 337040
Hand: 88AAK, Bid: 575, Hand Type: 3, Rank: 384
 Winnings: 220800
Hand: 899K8, Bid: 918, Hand Type: 3, Rank: 385
 Winnings: 353430
Hand: 8T9T8, Bid: 481, Hand Type: 3, Rank: 386
 Winnings: 185666
Hand: 8TT66, Bid: 569, Hand Type: 3, Rank: 387
 Winnings: 220203
Hand: 8Q558, Bid: 783, Hand Type: 3, Rank: 388
 Winnings: 303804
Hand: 9229K, Bid: 593, Hand Type: 3, Rank: 389
 Winnings: 230677
Hand: 95353, Bid: 16, Hand Type: 3, Rank: 390
 Winnings: 6240
Hand: 95945, Bid: 957, Hand Type: 3, Rank: 391
 Winnings: 374187
Hand: 966Q9, Bid: 710, Hand Type: 3, Rank: 392
 Winnings: 278320
Hand: 96869, Bid: 102, Hand Type: 3, Rank: 393
 Winnings: 40086
Hand: 97697, Bid: 211, Hand Type: 3, Rank: 394
 Winnings: 83134
Hand: 98982, Bid: 747, Hand Type: 3, Rank: 395
 Winnings: 295065
Hand: 99833, Bid: 215, Hand Type: 3, Rank: 396
 Winnings: 85140
Hand: 9TTK9, Bid: 58, Hand Type: 3, Rank: 397
 Winnings: 23026
Hand: 9Q898, Bid: 484, Hand Type: 3, Rank: 398
 Winnings: 192632
Hand: 9A95A, Bid: 87, Hand Type: 3, Rank: 399
 Winnings: 34713
Hand: T3399, Bid: 570, Hand Type: 3, Rank: 400
 Winnings: 228000
Hand: T559T, Bid: 695, Hand Type: 3, Rank: 401
 Winnings: 278695
Hand: T929T, Bid: 902, Hand Type: 3, Rank: 402
 Winnings: 362604
Hand: T99TQ, Bid: 456, Hand Type: 3, Rank: 403
 Winnings: 183768
Hand: TKTQQ, Bid: 476, Hand Type: 3, Rank: 404
 Winnings: 192304
Hand: Q3Q43, Bid: 568, Hand Type: 3, Rank: 405
 Winnings: 230040
Hand: Q565Q, Bid: 995, Hand Type: 3, Rank: 406
 Winnings: 403970
Hand: Q58Q5, Bid: 183, Hand Type: 3, Rank: 407
 Winnings: 74481
Hand: Q665Q, Bid: 114, Hand Type: 3, Rank: 408
 Winnings: 46512
Hand: Q858Q, Bid: 442, Hand Type: 3, Rank: 409
 Winnings: 180778
Hand: Q93Q9, Bid: 793, Hand Type: 3, Rank: 410
 Winnings: 325130
Hand: Q944Q, Bid: 872, Hand Type: 3, Rank: 411
 Winnings: 358392
Hand: QQ522, Bid: 7, Hand Type: 3, Rank: 412
 Winnings: 2884
Hand: QQ992, Bid: 849, Hand Type: 3, Rank: 413
 Winnings: 350637
Hand: QQA22, Bid: 400, Hand Type: 3, Rank: 414
 Winnings: 165600
Hand: QA7AQ, Bid: 287, Hand Type: 3, Rank: 415
 Winnings: 119105
Hand: K6K55, Bid: 161, Hand Type: 3, Rank: 416
 Winnings: 66976
Hand: KK233, Bid: 962, Hand Type: 3, Rank: 417
 Winnings: 401154
Hand: KK288, Bid: 540, Hand Type: 3, Rank: 418
 Winnings: 225720
Hand: KK399, Bid: 948, Hand Type: 3, Rank: 419
 Winnings: 397212
Hand: KK55T, Bid: 536, Hand Type: 3, Rank: 420
 Winnings: 225120
Hand: KK663, Bid: 300, Hand Type: 3, Rank: 421
 Winnings: 126300
Hand: KK66T, Bid: 672, Hand Type: 3, Rank: 422
 Winnings: 283584
Hand: KK7A7, Bid: 73, Hand Type: 3, Rank: 423
 Winnings: 30879
Hand: KK883, Bid: 417, Hand Type: 3, Rank: 424
 Winnings: 176808
Hand: KKQQ3, Bid: 213, Hand Type: 3, Rank: 425
 Winnings: 90525
Hand: A22TT, Bid: 996, Hand Type: 3, Rank: 426
 Winnings: 424296
Hand: A3663, Bid: 24, Hand Type: 3, Rank: 427
 Winnings: 10248
Hand: A3QAQ, Bid: 72, Hand Type: 3, Rank: 428
 Winnings: 30816
Hand: A84A4, Bid: 222, Hand Type: 3, Rank: 429
 Winnings: 95238
Hand: A9898, Bid: 703, Hand Type: 3, Rank: 430
 Winnings: 302290
Hand: AA442, Bid: 572, Hand Type: 3, Rank: 431
 Winnings: 246532
Hand: AA5TT, Bid: 937, Hand Type: 3, Rank: 432
 Winnings: 404784
Hand: AA797, Bid: 268, Hand Type: 3, Rank: 433
 Winnings: 116044
Hand: JJ956, Bid: 415, Hand Type: 4, Rank: 434
 Winnings: 180110
Hand: JJKAT, Bid: 184, Hand Type: 4, Rank: 435
 Winnings: 80040
Hand: J2296, Bid: 817, Hand Type: 4, Rank: 436
 Winnings: 356212
Hand: J2782, Bid: 574, Hand Type: 4, Rank: 437
 Winnings: 250838
Hand: J28J6, Bid: 76, Hand Type: 4, Rank: 438
 Winnings: 33288
Hand: J3JQ2, Bid: 869, Hand Type: 4, Rank: 439
 Winnings: 381491
Hand: J32J5, Bid: 498, Hand Type: 4, Rank: 440
 Winnings: 219120
Hand: J3QJ5, Bid: 387, Hand Type: 4, Rank: 441
 Winnings: 170667
Hand: J4624, Bid: 567, Hand Type: 4, Rank: 442
 Winnings: 250614
Hand: J5T54, Bid: 53, Hand Type: 4, Rank: 443
 Winnings: 23479
Hand: J6368, Bid: 199, Hand Type: 4, Rank: 444
 Winnings: 88356
Hand: J668A, Bid: 919, Hand Type: 4, Rank: 445
 Winnings: 408955
Hand: J688A, Bid: 127, Hand Type: 4, Rank: 446
 Winnings: 56642
Hand: J73JK, Bid: 122, Hand Type: 4, Rank: 447
 Winnings: 54534
Hand: J7974, Bid: 796, Hand Type: 4, Rank: 448
 Winnings: 356608
Hand: J7T55, Bid: 935, Hand Type: 4, Rank: 449
 Winnings: 419815
Hand: J82TT, Bid: 488, Hand Type: 4, Rank: 450
 Winnings: 219600
Hand: J8827, Bid: 651, Hand Type: 4, Rank: 451
 Winnings: 293601
Hand: J9J27, Bid: 509, Hand Type: 4, Rank: 452
 Winnings: 230068
Hand: J9A94, Bid: 500, Hand Type: 4, Rank: 453
 Winnings: 226500
Hand: JT54J, Bid: 208, Hand Type: 4, Rank: 454
 Winnings: 94432
Hand: JT5KJ, Bid: 638, Hand Type: 4, Rank: 455
 Winnings: 290290
Hand: JT676, Bid: 721, Hand Type: 4, Rank: 456
 Winnings: 328776
Hand: JK447, Bid: 528, Hand Type: 4, Rank: 457
 Winnings: 241296
Hand: JK599, Bid: 632, Hand Type: 4, Rank: 458
 Winnings: 289456
Hand: JK6KT, Bid: 341, Hand Type: 4, Rank: 459
 Winnings: 156519
Hand: JKA2J, Bid: 173, Hand Type: 4, Rank: 460
 Winnings: 79580
Hand: JA2QJ, Bid: 797, Hand Type: 4, Rank: 461
 Winnings: 367417
Hand: 2J247, Bid: 319, Hand Type: 4, Rank: 462
 Winnings: 147378
Hand: 2J445, Bid: 713, Hand Type: 4, Rank: 463
 Winnings: 330119
Hand: 22253, Bid: 68, Hand Type: 4, Rank: 464
 Winnings: 31552
Hand: 22572, Bid: 335, Hand Type: 4, Rank: 465
 Winnings: 155775
Hand: 24555, Bid: 245, Hand Type: 4, Rank: 466
 Winnings: 114170
Hand: 24K44, Bid: 739, Hand Type: 4, Rank: 467
 Winnings: 345113
Hand: 277T7, Bid: 764, Hand Type: 4, Rank: 468
 Winnings: 357552
Hand: 29228, Bid: 551, Hand Type: 4, Rank: 469
 Winnings: 258419
Hand: 292T2, Bid: 774, Hand Type: 4, Rank: 470
 Winnings: 363780
Hand: 2Q5QQ, Bid: 881, Hand Type: 4, Rank: 471
 Winnings: 414951
Hand: 2QQQ3, Bid: 75, Hand Type: 4, Rank: 472
 Winnings: 35400
Hand: 2K242, Bid: 320, Hand Type: 4, Rank: 473
 Winnings: 151360
Hand: 2A333, Bid: 626, Hand Type: 4, Rank: 474
 Winnings: 296724
Hand: 3J342, Bid: 925, Hand Type: 4, Rank: 475
 Winnings: 439375
Hand: 33J45, Bid: 886, Hand Type: 4, Rank: 476
 Winnings: 421736
Hand: 33352, Bid: 591, Hand Type: 4, Rank: 477
 Winnings: 281907
Hand: 3353T, Bid: 297, Hand Type: 4, Rank: 478
 Winnings: 141966
Hand: 33T4J, Bid: 281, Hand Type: 4, Rank: 479
 Winnings: 134599
Hand: 33Q23, Bid: 283, Hand Type: 4, Rank: 480
 Winnings: 135840
Hand: 33K63, Bid: 623, Hand Type: 4, Rank: 481
 Winnings: 299663
Hand: 34323, Bid: 735, Hand Type: 4, Rank: 482
 Winnings: 354270
Hand: 344JQ, Bid: 18, Hand Type: 4, Rank: 483
 Winnings: 8694
Hand: 34442, Bid: 41, Hand Type: 4, Rank: 484
 Winnings: 19844
Hand: 35K33, Bid: 366, Hand Type: 4, Rank: 485
 Winnings: 177510
Hand: 363J7, Bid: 603, Hand Type: 4, Rank: 486
 Winnings: 293058
Hand: 37555, Bid: 609, Hand Type: 4, Rank: 487
 Winnings: 296583
Hand: 38343, Bid: 860, Hand Type: 4, Rank: 488
 Winnings: 419680
Hand: 3Q77J, Bid: 295, Hand Type: 4, Rank: 489
 Winnings: 144255
Hand: 3Q9QQ, Bid: 495, Hand Type: 4, Rank: 490
 Winnings: 242550
Hand: 3QTTT, Bid: 455, Hand Type: 4, Rank: 491
 Winnings: 223405
Hand: 3K555, Bid: 330, Hand Type: 4, Rank: 492
 Winnings: 162360
Hand: 4J684, Bid: 391, Hand Type: 4, Rank: 493
 Winnings: 192763
Hand: 4J834, Bid: 964, Hand Type: 4, Rank: 494
 Winnings: 476216
Hand: 4333A, Bid: 959, Hand Type: 4, Rank: 495
 Winnings: 474705
Hand: 4339J, Bid: 541, Hand Type: 4, Rank: 496
 Winnings: 268336
Hand: 44349, Bid: 474, Hand Type: 4, Rank: 497
 Winnings: 235578
Hand: 44384, Bid: 560, Hand Type: 4, Rank: 498
 Winnings: 278880
Hand: 44429, Bid: 326, Hand Type: 4, Rank: 499
 Winnings: 162674
Hand: 449Q4, Bid: 454, Hand Type: 4, Rank: 500
 Winnings: 227000
Hand: 453JJ, Bid: 683, Hand Type: 4, Rank: 501
 Winnings: 342183
Hand: 45464, Bid: 31, Hand Type: 4, Rank: 502
 Winnings: 15562
Hand: 46J56, Bid: 465, Hand Type: 4, Rank: 503
 Winnings: 233895
Hand: 46667, Bid: 906, Hand Type: 4, Rank: 504
 Winnings: 456624
Hand: 4666Q, Bid: 163, Hand Type: 4, Rank: 505
 Winnings: 82315
Hand: 47424, Bid: 394, Hand Type: 4, Rank: 506
 Winnings: 199364
Hand: 483JJ, Bid: 170, Hand Type: 4, Rank: 507
 Winnings: 86190
Hand: 48464, Bid: 792, Hand Type: 4, Rank: 508
 Winnings: 402336
Hand: 48A44, Bid: 627, Hand Type: 4, Rank: 509
 Winnings: 319143
Hand: 49J24, Bid: 71, Hand Type: 4, Rank: 510
 Winnings: 36210
Hand: 4T474, Bid: 285, Hand Type: 4, Rank: 511
 Winnings: 145635
Hand: 4Q44K, Bid: 625, Hand Type: 4, Rank: 512
 Winnings: 320000
Hand: 4K6KJ, Bid: 349, Hand Type: 4, Rank: 513
 Winnings: 179037
Hand: 5J59A, Bid: 421, Hand Type: 4, Rank: 514
 Winnings: 216394
Hand: 5JK35, Bid: 369, Hand Type: 4, Rank: 515
 Winnings: 190035
Hand: 52292, Bid: 250, Hand Type: 4, Rank: 516
 Winnings: 129000
Hand: 53633, Bid: 405, Hand Type: 4, Rank: 517
 Winnings: 209385
Hand: 53AJA, Bid: 371, Hand Type: 4, Rank: 518
 Winnings: 192178
Hand: 53AAA, Bid: 12, Hand Type: 4, Rank: 519
 Winnings: 6228
Hand: 54J75, Bid: 186, Hand Type: 4, Rank: 520
 Winnings: 96720
Hand: 54844, Bid: 334, Hand Type: 4, Rank: 521
 Winnings: 174014
Hand: 55J4K, Bid: 357, Hand Type: 4, Rank: 522
 Winnings: 186354
Hand: 5556Q, Bid: 517, Hand Type: 4, Rank: 523
 Winnings: 270391
Hand: 555Q8, Bid: 776, Hand Type: 4, Rank: 524
 Winnings: 406624
Hand: 55856, Bid: 610, Hand Type: 4, Rank: 525
 Winnings: 320250
Hand: 5594J, Bid: 4, Hand Type: 4, Rank: 526
 Winnings: 2104
Hand: 55TJ3, Bid: 151, Hand Type: 4, Rank: 527
 Winnings: 79577
Hand: 55Q54, Bid: 965, Hand Type: 4, Rank: 528
 Winnings: 509520
Hand: 56J54, Bid: 438, Hand Type: 4, Rank: 529
 Winnings: 231702
Hand: 56JA5, Bid: 701, Hand Type: 4, Rank: 530
 Winnings: 371530
Hand: 5655A, Bid: 351, Hand Type: 4, Rank: 531
 Winnings: 186381
Hand: 566J3, Bid: 729, Hand Type: 4, Rank: 532
 Winnings: 387828
Hand: 573J7, Bid: 221, Hand Type: 4, Rank: 533
 Winnings: 117793
Hand: 58955, Bid: 547, Hand Type: 4, Rank: 534
 Winnings: 292098
Hand: 59JQQ, Bid: 240, Hand Type: 4, Rank: 535
 Winnings: 128400
Hand: 59455, Bid: 889, Hand Type: 4, Rank: 536
 Winnings: 476504
Hand: 59996, Bid: 933, Hand Type: 4, Rank: 537
 Winnings: 501021
Hand: 599QJ, Bid: 395, Hand Type: 4, Rank: 538
 Winnings: 212510
Hand: 5T6JT, Bid: 751, Hand Type: 4, Rank: 539
 Winnings: 404789
Hand: 5QJ44, Bid: 670, Hand Type: 4, Rank: 540
 Winnings: 361800
Hand: 5K455, Bid: 362, Hand Type: 4, Rank: 541
 Winnings: 195842
Hand: 5A66J, Bid: 261, Hand Type: 4, Rank: 542
 Winnings: 141462
Hand: 6J434, Bid: 47, Hand Type: 4, Rank: 543
 Winnings: 25521
Hand: 6JK36, Bid: 386, Hand Type: 4, Rank: 544
 Winnings: 209984
Hand: 6JA22, Bid: 162, Hand Type: 4, Rank: 545
 Winnings: 88290
Hand: 6JA99, Bid: 35, Hand Type: 4, Rank: 546
 Winnings: 19110
Hand: 63888, Bid: 782, Hand Type: 4, Rank: 547
 Winnings: 427754
Hand: 656A6, Bid: 313, Hand Type: 4, Rank: 548
 Winnings: 171524
Hand: 6625J, Bid: 338, Hand Type: 4, Rank: 549
 Winnings: 185562
Hand: 6639J, Bid: 898, Hand Type: 4, Rank: 550
 Winnings: 493900
Hand: 666Q2, Bid: 535, Hand Type: 4, Rank: 551
 Winnings: 294785
Hand: 67222, Bid: 314, Hand Type: 4, Rank: 552
 Winnings: 173328
Hand: 67877, Bid: 77, Hand Type: 4, Rank: 553
 Winnings: 42581
Hand: 69766, Bid: 440, Hand Type: 4, Rank: 554
 Winnings: 243760
Hand: 6TJ6K, Bid: 899, Hand Type: 4, Rank: 555
 Winnings: 498945
Hand: 6T6K6, Bid: 196, Hand Type: 4, Rank: 556
 Winnings: 108976
Hand: 6Q2QQ, Bid: 983, Hand Type: 4, Rank: 557
 Winnings: 547531
Hand: 6QQQ5, Bid: 214, Hand Type: 4, Rank: 558
 Winnings: 119412
Hand: 72333, Bid: 807, Hand Type: 4, Rank: 559
 Winnings: 451113
Hand: 74J67, Bid: 209, Hand Type: 4, Rank: 560
 Winnings: 117040
Hand: 7437J, Bid: 769, Hand Type: 4, Rank: 561
 Winnings: 431409
Hand: 766J4, Bid: 553, Hand Type: 4, Rank: 562
 Winnings: 310786
Hand: 7747Q, Bid: 1, Hand Type: 4, Rank: 563
 Winnings: 563
Hand: 79J96, Bid: 895, Hand Type: 4, Rank: 564
 Winnings: 504780
Hand: 79772, Bid: 96, Hand Type: 4, Rank: 565
 Winnings: 54240
Hand: 799JA, Bid: 596, Hand Type: 4, Rank: 566
 Winnings: 337336
Hand: 79QQQ, Bid: 883, Hand Type: 4, Rank: 567
 Winnings: 500661
Hand: 7T77A, Bid: 882, Hand Type: 4, Rank: 568
 Winnings: 500976
Hand: 7QJ2Q, Bid: 237, Hand Type: 4, Rank: 569
 Winnings: 134853
Hand: 7KQJQ, Bid: 505, Hand Type: 4, Rank: 570
 Winnings: 287850
Hand: 7KKJ2, Bid: 79, Hand Type: 4, Rank: 571
 Winnings: 45109
Hand: 7A77Q, Bid: 105, Hand Type: 4, Rank: 572
 Winnings: 60060
Hand: 8J428, Bid: 855, Hand Type: 4, Rank: 573
 Winnings: 489915
Hand: 8J6J5, Bid: 187, Hand Type: 4, Rank: 574
 Winnings: 107338
Hand: 8JQ78, Bid: 866, Hand Type: 4, Rank: 575
 Winnings: 497950
Hand: 82T2J, Bid: 425, Hand Type: 4, Rank: 576
 Winnings: 244800
Hand: 86488, Bid: 815, Hand Type: 4, Rank: 577
 Winnings: 470255
Hand: 87J73, Bid: 276, Hand Type: 4, Rank: 578
 Winnings: 159528
Hand: 87JT7, Bid: 744, Hand Type: 4, Rank: 579
 Winnings: 430776
Hand: 8777K, Bid: 708, Hand Type: 4, Rank: 580
 Winnings: 410640
Hand: 88285, Bid: 534, Hand Type: 4, Rank: 581
 Winnings: 310254
Hand: 88498, Bid: 340, Hand Type: 4, Rank: 582
 Winnings: 197880
Hand: 88K78, Bid: 645, Hand Type: 4, Rank: 583
 Winnings: 376035
Hand: 8T7TT, Bid: 748, Hand Type: 4, Rank: 584
 Winnings: 436832
Hand: 8T88K, Bid: 868, Hand Type: 4, Rank: 585
 Winnings: 507780
Hand: 8QQ7J, Bid: 955, Hand Type: 4, Rank: 586
 Winnings: 559630
Hand: 8K58J, Bid: 915, Hand Type: 4, Rank: 587
 Winnings: 537105
Hand: 8A868, Bid: 616, Hand Type: 4, Rank: 588
 Winnings: 362208
Hand: 9J3KK, Bid: 491, Hand Type: 4, Rank: 589
 Winnings: 289199
Hand: 9J4J2, Bid: 580, Hand Type: 4, Rank: 590
 Winnings: 342200
Hand: 9J964, Bid: 143, Hand Type: 4, Rank: 591
 Winnings: 84513
Hand: 9JK44, Bid: 743, Hand Type: 4, Rank: 592
 Winnings: 439856
Hand: 92242, Bid: 579, Hand Type: 4, Rank: 593
 Winnings: 343347
Hand: 92272, Bid: 318, Hand Type: 4, Rank: 594
 Winnings: 188892
Hand: 94333, Bid: 660, Hand Type: 4, Rank: 595
 Winnings: 392700
Hand: 95994, Bid: 757, Hand Type: 4, Rank: 596
 Winnings: 451172
Hand: 969K9, Bid: 981, Hand Type: 4, Rank: 597
 Winnings: 585657
Hand: 97994, Bid: 644, Hand Type: 4, Rank: 598
 Winnings: 385112
Hand: 987J7, Bid: 296, Hand Type: 4, Rank: 599
 Winnings: 177304
Hand: 993T9, Bid: 643, Hand Type: 4, Rank: 600
 Winnings: 385800
Hand: 9TT3J, Bid: 361, Hand Type: 4, Rank: 601
 Winnings: 216961
Hand: 9TTTK, Bid: 49, Hand Type: 4, Rank: 602
 Winnings: 29498
Hand: 9KQKK, Bid: 975, Hand Type: 4, Rank: 603
 Winnings: 587925
Hand: 9KKJT, Bid: 152, Hand Type: 4, Rank: 604
 Winnings: 91808
Hand: 9KKKT, Bid: 759, Hand Type: 4, Rank: 605
 Winnings: 459195
Hand: 9A555, Bid: 348, Hand Type: 4, Rank: 606
 Winnings: 210888
Hand: TJ522, Bid: 911, Hand Type: 4, Rank: 607
 Winnings: 552977
Hand: TJT97, Bid: 236, Hand Type: 4, Rank: 608
 Winnings: 143488
Hand: T33JK, Bid: 389, Hand Type: 4, Rank: 609
 Winnings: 236901
Hand: T3339, Bid: 86, Hand Type: 4, Rank: 610
 Winnings: 52460
Hand: T4KJT, Bid: 917, Hand Type: 4, Rank: 611
 Winnings: 560287
Hand: T5TTK, Bid: 682, Hand Type: 4, Rank: 612
 Winnings: 417384
Hand: T5K5J, Bid: 451, Hand Type: 4, Rank: 613
 Winnings: 276463
Hand: T7QTT, Bid: 383, Hand Type: 4, Rank: 614
 Winnings: 235162
Hand: T9996, Bid: 238, Hand Type: 4, Rank: 615
 Winnings: 146370
Hand: T9T3T, Bid: 991, Hand Type: 4, Rank: 616
 Winnings: 610456
Hand: TT2TQ, Bid: 399, Hand Type: 4, Rank: 617
 Winnings: 246183
Hand: TT3KJ, Bid: 668, Hand Type: 4, Rank: 618
 Winnings: 412824
Hand: TT9JQ, Bid: 278, Hand Type: 4, Rank: 619
 Winnings: 172082
Hand: TT98T, Bid: 342, Hand Type: 4, Rank: 620
 Winnings: 212040
Hand: TTT28, Bid: 519, Hand Type: 4, Rank: 621
 Winnings: 322299
Hand: TTTQ6, Bid: 142, Hand Type: 4, Rank: 622
 Winnings: 88324
Hand: TQJQ8, Bid: 732, Hand Type: 4, Rank: 623
 Winnings: 456036
Hand: TK3KK, Bid: 794, Hand Type: 4, Rank: 624
 Winnings: 495456
Hand: TKQQQ, Bid: 810, Hand Type: 4, Rank: 625
 Winnings: 506250
Hand: TKK8K, Bid: 288, Hand Type: 4, Rank: 626
 Winnings: 180288
Hand: TAJ6A, Bid: 520, Hand Type: 4, Rank: 627
 Winnings: 326040
Hand: TAJA9, Bid: 526, Hand Type: 4, Rank: 628
 Winnings: 330328
Hand: TA44J, Bid: 59, Hand Type: 4, Rank: 629
 Winnings: 37111
Hand: TAAA7, Bid: 715, Hand Type: 4, Rank: 630
 Winnings: 450450
Hand: QJ225, Bid: 523, Hand Type: 4, Rank: 631
 Winnings: 330013
Hand: QJ828, Bid: 791, Hand Type: 4, Rank: 632
 Winnings: 499912
Hand: QJT22, Bid: 598, Hand Type: 4, Rank: 633
 Winnings: 378534
Hand: QJK99, Bid: 467, Hand Type: 4, Rank: 634
 Winnings: 296078
Hand: Q2272, Bid: 515, Hand Type: 4, Rank: 635
 Winnings: 327025
Hand: Q3Q4Q, Bid: 994, Hand Type: 4, Rank: 636
 Winnings: 632184
Hand: Q4JJ5, Bid: 333, Hand Type: 4, Rank: 637
 Winnings: 212121
Hand: Q6656, Bid: 525, Hand Type: 4, Rank: 638
 Winnings: 334950
Hand: Q7JTT, Bid: 248, Hand Type: 4, Rank: 639
 Winnings: 158472
Hand: Q7JQ6, Bid: 607, Hand Type: 4, Rank: 640
 Winnings: 388480
Hand: Q85JQ, Bid: 378, Hand Type: 4, Rank: 641
 Winnings: 242298
Hand: QQJA5, Bid: 854, Hand Type: 4, Rank: 642
 Winnings: 548268
Hand: QQQ35, Bid: 316, Hand Type: 4, Rank: 643
 Winnings: 203188
Hand: QQQT3, Bid: 88, Hand Type: 4, Rank: 644
 Winnings: 56672
Hand: QQK2J, Bid: 345, Hand Type: 4, Rank: 645
 Winnings: 222525
Hand: QKQ5Q, Bid: 802, Hand Type: 4, Rank: 646
 Winnings: 518092
Hand: QAKJK, Bid: 310, Hand Type: 4, Rank: 647
 Winnings: 200570
Hand: KJJ43, Bid: 200, Hand Type: 4, Rank: 648
 Winnings: 129600
Hand: KJ344, Bid: 876, Hand Type: 4, Rank: 649
 Winnings: 568524
Hand: K56KK, Bid: 587, Hand Type: 4, Rank: 650
 Winnings: 381550
Hand: K6663, Bid: 110, Hand Type: 4, Rank: 651
 Winnings: 71610
Hand: K6866, Bid: 982, Hand Type: 4, Rank: 652
 Winnings: 640264
Hand: K6KJA, Bid: 273, Hand Type: 4, Rank: 653
 Winnings: 178269
Hand: K7J7A, Bid: 946, Hand Type: 4, Rank: 654
 Winnings: 618684
Hand: K7779, Bid: 554, Hand Type: 4, Rank: 655
 Winnings: 362870
Hand: KK29J, Bid: 201, Hand Type: 4, Rank: 656
 Winnings: 131856
Hand: KK35K, Bid: 673, Hand Type: 4, Rank: 657
 Winnings: 442161
Hand: KK7K5, Bid: 176, Hand Type: 4, Rank: 658
 Winnings: 115808
Hand: KAJK8, Bid: 711, Hand Type: 4, Rank: 659
 Winnings: 468549
Hand: KA5AA, Bid: 26, Hand Type: 4, Rank: 660
 Winnings: 17160
Hand: AJ522, Bid: 286, Hand Type: 4, Rank: 661
 Winnings: 189046
Hand: AJ73J, Bid: 831, Hand Type: 4, Rank: 662
 Winnings: 550122
Hand: AJKJ4, Bid: 490, Hand Type: 4, Rank: 663
 Winnings: 324870
Hand: A3KAA, Bid: 106, Hand Type: 4, Rank: 664
 Winnings: 70384
Hand: A3AAT, Bid: 352, Hand Type: 4, Rank: 665
 Winnings: 234080
Hand: A444Q, Bid: 325, Hand Type: 4, Rank: 666
 Winnings: 216450
Hand: A4A3J, Bid: 360, Hand Type: 4, Rank: 667
 Winnings: 240120
Hand: A6866, Bid: 837, Hand Type: 4, Rank: 668
 Winnings: 559116
Hand: A73JA, Bid: 646, Hand Type: 4, Rank: 669
 Winnings: 432174
Hand: AQQQT, Bid: 709, Hand Type: 4, Rank: 670
 Winnings: 475030
Hand: AKATA, Bid: 188, Hand Type: 4, Rank: 671
 Winnings: 126148
Hand: AA3TJ, Bid: 960, Hand Type: 4, Rank: 672
 Winnings: 645120
Hand: AA4TA, Bid: 3, Hand Type: 4, Rank: 673
 Winnings: 2019
Hand: AAKA9, Bid: 577, Hand Type: 4, Rank: 674
 Winnings: 388898
Hand: AAA8T, Bid: 799, Hand Type: 4, Rank: 675
 Winnings: 539325
Hand: J2424, Bid: 302, Hand Type: 5, Rank: 676
 Winnings: 204152
Hand: J6996, Bid: 254, Hand Type: 5, Rank: 677
 Winnings: 171958
Hand: J77TT, Bid: 813, Hand Type: 5, Rank: 678
 Winnings: 551214
Hand: JQ77Q, Bid: 692, Hand Type: 5, Rank: 679
 Winnings: 469868
Hand: JQQ22, Bid: 441, Hand Type: 5, Rank: 680
 Winnings: 299880
Hand: 22277, Bid: 635, Hand Type: 5, Rank: 681
 Winnings: 432435
Hand: 222TT, Bid: 123, Hand Type: 5, Rank: 682
 Winnings: 83886
Hand: 222KK, Bid: 339, Hand Type: 5, Rank: 683
 Winnings: 231537
Hand: 22626, Bid: 128, Hand Type: 5, Rank: 684
 Winnings: 87552
Hand: 25J52, Bid: 717, Hand Type: 5, Rank: 685
 Winnings: 491145
Hand: 26662, Bid: 686, Hand Type: 5, Rank: 686
 Winnings: 470596
Hand: 28228, Bid: 985, Hand Type: 5, Rank: 687
 Winnings: 676695
Hand: 29229, Bid: 309, Hand Type: 5, Rank: 688
 Winnings: 212592
Hand: 2QQ2Q, Bid: 450, Hand Type: 5, Rank: 689
 Winnings: 310050
Hand: 2A2JA, Bid: 55, Hand Type: 5, Rank: 690
 Winnings: 37950
Hand: 3J939, Bid: 909, Hand Type: 5, Rank: 691
 Winnings: 628119
Hand: 33388, Bid: 148, Hand Type: 5, Rank: 692
 Winnings: 102416
Hand: 33663, Bid: 571, Hand Type: 5, Rank: 693
 Winnings: 395703
Hand: 33K3K, Bid: 852, Hand Type: 5, Rank: 694
 Winnings: 591288
Hand: 34433, Bid: 801, Hand Type: 5, Rank: 695
 Winnings: 556695
Hand: 34434, Bid: 640, Hand Type: 5, Rank: 696
 Winnings: 445440
Hand: 3773J, Bid: 545, Hand Type: 5, Rank: 697
 Winnings: 379865
Hand: 38838, Bid: 772, Hand Type: 5, Rank: 698
 Winnings: 538856
Hand: 39339, Bid: 282, Hand Type: 5, Rank: 699
 Winnings: 197118
Hand: 3A33A, Bid: 494, Hand Type: 5, Rank: 700
 Winnings: 345800
Hand: 433J4, Bid: 304, Hand Type: 5, Rank: 701
 Winnings: 213104
Hand: 44222, Bid: 600, Hand Type: 5, Rank: 702
 Winnings: 421200
Hand: 44466, Bid: 940, Hand Type: 5, Rank: 703
 Winnings: 660820
Hand: 449J9, Bid: 728, Hand Type: 5, Rank: 704
 Winnings: 512512
Hand: 4664J, Bid: 205, Hand Type: 5, Rank: 705
 Winnings: 144525
Hand: 46664, Bid: 350, Hand Type: 5, Rank: 706
 Winnings: 247100
Hand: 47747, Bid: 466, Hand Type: 5, Rank: 707
 Winnings: 329462
Hand: 48884, Bid: 426, Hand Type: 5, Rank: 708
 Winnings: 301608
Hand: 4T4JT, Bid: 812, Hand Type: 5, Rank: 709
 Winnings: 575708
Hand: 4TT4T, Bid: 160, Hand Type: 5, Rank: 710
 Winnings: 113600
Hand: 4AA4A, Bid: 877, Hand Type: 5, Rank: 711
 Winnings: 623547
Hand: 53355, Bid: 639, Hand Type: 5, Rank: 712
 Winnings: 454968
Hand: 55333, Bid: 267, Hand Type: 5, Rank: 713
 Winnings: 190371
Hand: 55444, Bid: 746, Hand Type: 5, Rank: 714
 Winnings: 532644
Hand: 555TT, Bid: 64, Hand Type: 5, Rank: 715
 Winnings: 45760
Hand: 555AA, Bid: 111, Hand Type: 5, Rank: 716
 Winnings: 79476
Hand: 55888, Bid: 749, Hand Type: 5, Rank: 717
 Winnings: 537033
Hand: 55KK5, Bid: 829, Hand Type: 5, Rank: 718
 Winnings: 595222
Hand: 56656, Bid: 483, Hand Type: 5, Rank: 719
 Winnings: 347277
Hand: 58855, Bid: 501, Hand Type: 5, Rank: 720
 Winnings: 360720
Hand: 595J9, Bid: 307, Hand Type: 5, Rank: 721
 Winnings: 221347
Hand: 59955, Bid: 862, Hand Type: 5, Rank: 722
 Winnings: 622364
Hand: 59995, Bid: 101, Hand Type: 5, Rank: 723
 Winnings: 73023
Hand: 5QQQ5, Bid: 478, Hand Type: 5, Rank: 724
 Winnings: 346072
Hand: 66363, Bid: 70, Hand Type: 5, Rank: 725
 Winnings: 50750
Hand: 665J5, Bid: 453, Hand Type: 5, Rank: 726
 Winnings: 328878
Hand: 66TTT, Bid: 984, Hand Type: 5, Rank: 727
 Winnings: 715368
Hand: 66Q6Q, Bid: 543, Hand Type: 5, Rank: 728
 Winnings: 395304
Hand: 66KJK, Bid: 486, Hand Type: 5, Rank: 729
 Winnings: 354294
Hand: 67677, Bid: 527, Hand Type: 5, Rank: 730
 Winnings: 384710
Hand: 68668, Bid: 819, Hand Type: 5, Rank: 731
 Winnings: 598689
Hand: 6T6T6, Bid: 590, Hand Type: 5, Rank: 732
 Winnings: 431880
Hand: 6K66K, Bid: 850, Hand Type: 5, Rank: 733
 Winnings: 623050
Hand: 6AA6A, Bid: 212, Hand Type: 5, Rank: 734
 Winnings: 155608
Hand: 7J766, Bid: 652, Hand Type: 5, Rank: 735
 Winnings: 479220
Hand: 7J878, Bid: 586, Hand Type: 5, Rank: 736
 Winnings: 431296
Hand: 75575, Bid: 419, Hand Type: 5, Rank: 737
 Winnings: 308803
Hand: 75757, Bid: 544, Hand Type: 5, Rank: 738
 Winnings: 401472
Hand: 77J55, Bid: 779, Hand Type: 5, Rank: 739
 Winnings: 575681
Hand: 77666, Bid: 279, Hand Type: 5, Rank: 740
 Winnings: 206460
Hand: 777TT, Bid: 938, Hand Type: 5, Rank: 741
 Winnings: 695058
Hand: 7799J, Bid: 482, Hand Type: 5, Rank: 742
 Winnings: 357644
Hand: 77QQ7, Bid: 379, Hand Type: 5, Rank: 743
 Winnings: 281597
Hand: 78877, Bid: 428, Hand Type: 5, Rank: 744
 Winnings: 318432
Hand: 7QQ7Q, Bid: 321, Hand Type: 5, Rank: 745
 Winnings: 239145
Hand: 7K7K7, Bid: 322, Hand Type: 5, Rank: 746
 Winnings: 240212
Hand: 7KK7J, Bid: 795, Hand Type: 5, Rank: 747
 Winnings: 593865
Hand: 7A77A, Bid: 576, Hand Type: 5, Rank: 748
 Winnings: 430848
Hand: 8J448, Bid: 977, Hand Type: 5, Rank: 749
 Winnings: 731773
Hand: 8558J, Bid: 879, Hand Type: 5, Rank: 750
 Winnings: 659250
Hand: 87878, Bid: 654, Hand Type: 5, Rank: 751
 Winnings: 491154
Hand: 8822J, Bid: 742, Hand Type: 5, Rank: 752
 Winnings: 557984
Hand: 883J3, Bid: 538, Hand Type: 5, Rank: 753
 Winnings: 405114
Hand: 88668, Bid: 251, Hand Type: 5, Rank: 754
 Winnings: 189254
Hand: 88989, Bid: 290, Hand Type: 5, Rank: 755
 Winnings: 218950
Hand: 88T8T, Bid: 755, Hand Type: 5, Rank: 756
 Winnings: 570780
Hand: 8T8TT, Bid: 134, Hand Type: 5, Rank: 757
 Winnings: 101438
Hand: 8QQ8Q, Bid: 914, Hand Type: 5, Rank: 758
 Winnings: 692812
Hand: 8AA88, Bid: 150, Hand Type: 5, Rank: 759
 Winnings: 113850
Hand: 9292J, Bid: 38, Hand Type: 5, Rank: 760
 Winnings: 28880
Hand: 94994, Bid: 272, Hand Type: 5, Rank: 761
 Winnings: 206992
Hand: 96669, Bid: 684, Hand Type: 5, Rank: 762
 Winnings: 521208
Hand: 97779, Bid: 169, Hand Type: 5, Rank: 763
 Winnings: 128947
Hand: 97997, Bid: 275, Hand Type: 5, Rank: 764
 Winnings: 210100
Hand: 99393, Bid: 730, Hand Type: 5, Rank: 765
 Winnings: 558450
Hand: 99669, Bid: 674, Hand Type: 5, Rank: 766
 Winnings: 516284
Hand: 998J8, Bid: 374, Hand Type: 5, Rank: 767
 Winnings: 286858
Hand: 999TT, Bid: 230, Hand Type: 5, Rank: 768
 Winnings: 176640
Hand: 99TTJ, Bid: 597, Hand Type: 5, Rank: 769
 Winnings: 459093
Hand: 99KKK, Bid: 83, Hand Type: 5, Rank: 770
 Winnings: 63910
Hand: 99AAA, Bid: 210, Hand Type: 5, Rank: 771
 Winnings: 161910
Hand: 9K9KJ, Bid: 449, Hand Type: 5, Rank: 772
 Winnings: 346628
Hand: T2TT2, Bid: 34, Hand Type: 5, Rank: 773
 Winnings: 26282
Hand: T3T33, Bid: 615, Hand Type: 5, Rank: 774
 Winnings: 476010
Hand: T3TT3, Bid: 667, Hand Type: 5, Rank: 775
 Winnings: 516925
Hand: TT2J2, Bid: 844, Hand Type: 5, Rank: 776
 Winnings: 654944
Hand: TATAT, Bid: 233, Hand Type: 5, Rank: 777
 Winnings: 181041
Hand: QJQ55, Bid: 884, Hand Type: 5, Rank: 778
 Winnings: 687752
Hand: Q55Q5, Bid: 992, Hand Type: 5, Rank: 779
 Winnings: 772768
Hand: Q6JQ6, Bid: 81, Hand Type: 5, Rank: 780
 Winnings: 63180
Hand: QTTTQ, Bid: 622, Hand Type: 5, Rank: 781
 Winnings: 485782
Hand: QTQQT, Bid: 252, Hand Type: 5, Rank: 782
 Winnings: 197064
Hand: QQ3Q3, Bid: 392, Hand Type: 5, Rank: 783
 Winnings: 306936
Hand: QQ9J9, Bid: 736, Hand Type: 5, Rank: 784
 Winnings: 577024
Hand: QQ9Q9, Bid: 963, Hand Type: 5, Rank: 785
 Winnings: 755955
Hand: QQQ66, Bid: 853, Hand Type: 5, Rank: 786
 Winnings: 670458
Hand: QQKKK, Bid: 894, Hand Type: 5, Rank: 787
 Winnings: 703578
Hand: QAQAQ, Bid: 452, Hand Type: 5, Rank: 788
 Winnings: 356176
Hand: K33JK, Bid: 784, Hand Type: 5, Rank: 789
 Winnings: 618576
Hand: K44JK, Bid: 582, Hand Type: 5, Rank: 790
 Winnings: 459780
Hand: K444K, Bid: 135, Hand Type: 5, Rank: 791
 Winnings: 106785
Hand: K44KK, Bid: 429, Hand Type: 5, Rank: 792
 Winnings: 339768
Hand: K55KK, Bid: 967, Hand Type: 5, Rank: 793
 Winnings: 766831
Hand: K88KJ, Bid: 346, Hand Type: 5, Rank: 794
 Winnings: 274724
Hand: K88KK, Bid: 823, Hand Type: 5, Rank: 795
 Winnings: 654285
Hand: K99K9, Bid: 459, Hand Type: 5, Rank: 796
 Winnings: 365364
Hand: KTTKK, Bid: 190, Hand Type: 5, Rank: 797
 Winnings: 151430
Hand: KTKTT, Bid: 634, Hand Type: 5, Rank: 798
 Winnings: 505932
Hand: KQKQQ, Bid: 770, Hand Type: 5, Rank: 799
 Winnings: 615230
Hand: KK2K2, Bid: 838, Hand Type: 5, Rank: 800
 Winnings: 670400
Hand: KKK66, Bid: 786, Hand Type: 5, Rank: 801
 Winnings: 629586
Hand: KKK77, Bid: 280, Hand Type: 5, Rank: 802
 Winnings: 224560
Hand: KAKAK, Bid: 13, Hand Type: 5, Rank: 803
 Winnings: 10439
Hand: A22A2, Bid: 74, Hand Type: 5, Rank: 804
 Winnings: 59496
Hand: A5J5A, Bid: 472, Hand Type: 5, Rank: 805
 Winnings: 379960
Hand: A666A, Bid: 493, Hand Type: 5, Rank: 806
 Winnings: 397358
Hand: AKAAK, Bid: 382, Hand Type: 5, Rank: 807
 Winnings: 308274
Hand: AA5A5, Bid: 920, Hand Type: 5, Rank: 808
 Winnings: 743360
Hand: AA77J, Bid: 1000, Hand Type: 5, Rank: 809
 Winnings: 809000
Hand: AA99J, Bid: 758, Hand Type: 5, Rank: 810
 Winnings: 613980
Hand: AA999, Bid: 144, Hand Type: 5, Rank: 811
 Winnings: 116784
Hand: AAA33, Bid: 56, Hand Type: 5, Rank: 812
 Winnings: 45472
Hand: JJ2J9, Bid: 997, Hand Type: 6, Rank: 813
 Winnings: 810561
Hand: JJ448, Bid: 514, Hand Type: 6, Rank: 814
 Winnings: 418396
Hand: JJTTK, Bid: 998, Hand Type: 6, Rank: 815
 Winnings: 813370
Hand: JJQJ4, Bid: 707, Hand Type: 6, Rank: 816
 Winnings: 576912
Hand: J2224, Bid: 926, Hand Type: 6, Rank: 817
 Winnings: 756542
Hand: J2QQJ, Bid: 630, Hand Type: 6, Rank: 818
 Winnings: 515340
Hand: J2AAA, Bid: 750, Hand Type: 6, Rank: 819
 Winnings: 614250
Hand: J444T, Bid: 614, Hand Type: 6, Rank: 820
 Winnings: 503480
Hand: J4Q4J, Bid: 863, Hand Type: 6, Rank: 821
 Winnings: 708523
Hand: J5J35, Bid: 439, Hand Type: 6, Rank: 822
 Winnings: 360858
Hand: J5565, Bid: 611, Hand Type: 6, Rank: 823
 Winnings: 502853
Hand: J5Q55, Bid: 229, Hand Type: 6, Rank: 824
 Winnings: 188696
Hand: J7J7T, Bid: 407, Hand Type: 6, Rank: 825
 Winnings: 335775
Hand: J8T8J, Bid: 118, Hand Type: 6, Rank: 826
 Winnings: 97468
Hand: J9J97, Bid: 23, Hand Type: 6, Rank: 827
 Winnings: 19021
Hand: JTJ55, Bid: 54, Hand Type: 6, Rank: 828
 Winnings: 44712
Hand: JTTTK, Bid: 328, Hand Type: 6, Rank: 829
 Winnings: 271912
Hand: JK8JK, Bid: 92, Hand Type: 6, Rank: 830
 Winnings: 76360
Hand: JKQQQ, Bid: 516, Hand Type: 6, Rank: 831
 Winnings: 428796
Hand: JAA5A, Bid: 966, Hand Type: 6, Rank: 832
 Winnings: 803712
Hand: JAAAK, Bid: 691, Hand Type: 6, Rank: 833
 Winnings: 575603
Hand: 2J227, Bid: 905, Hand Type: 6, Rank: 834
 Winnings: 754770
Hand: 2J5J2, Bid: 756, Hand Type: 6, Rank: 835
 Winnings: 631260
Hand: 2J822, Bid: 530, Hand Type: 6, Rank: 836
 Winnings: 443080
Hand: 22J62, Bid: 61, Hand Type: 6, Rank: 837
 Winnings: 51057
Hand: 22272, Bid: 814, Hand Type: 6, Rank: 838
 Winnings: 682132
Hand: 223J2, Bid: 432, Hand Type: 6, Rank: 839
 Winnings: 362448
Hand: 22K2J, Bid: 45, Hand Type: 6, Rank: 840
 Winnings: 37800
Hand: 23222, Bid: 720, Hand Type: 6, Rank: 841
 Winnings: 605520
Hand: 24222, Bid: 698, Hand Type: 6, Rank: 842
 Winnings: 587716
Hand: 28J2J, Bid: 435, Hand Type: 6, Rank: 843
 Winnings: 366705
Hand: 28222, Bid: 972, Hand Type: 6, Rank: 844
 Winnings: 820368
Hand: 29J22, Bid: 44, Hand Type: 6, Rank: 845
 Winnings: 37180
Hand: 29222, Bid: 423, Hand Type: 6, Rank: 846
 Winnings: 357858
Hand: 2AAAA, Bid: 305, Hand Type: 6, Rank: 847
 Winnings: 258335
Hand: 3333K, Bid: 332, Hand Type: 6, Rank: 848
 Winnings: 281536
Hand: 33383, Bid: 798, Hand Type: 6, Rank: 849
 Winnings: 677502
Hand: 33393, Bid: 277, Hand Type: 6, Rank: 850
 Winnings: 235450
Hand: 333A3, Bid: 737, Hand Type: 6, Rank: 851
 Winnings: 627187
Hand: 3373J, Bid: 141, Hand Type: 6, Rank: 852
 Winnings: 120132
Hand: 344J4, Bid: 518, Hand Type: 6, Rank: 853
 Winnings: 441854
Hand: 4J4Q4, Bid: 470, Hand Type: 6, Rank: 854
 Winnings: 401380
Hand: 44JJ5, Bid: 648, Hand Type: 6, Rank: 855
 Winnings: 554040
Hand: 44443, Bid: 408, Hand Type: 6, Rank: 856
 Winnings: 349248
Hand: 44446, Bid: 146, Hand Type: 6, Rank: 857
 Winnings: 125122
Hand: 4444K, Bid: 258, Hand Type: 6, Rank: 858
 Winnings: 221364
Hand: 4449J, Bid: 100, Hand Type: 6, Rank: 859
 Winnings: 85900
Hand: 45555, Bid: 857, Hand Type: 6, Rank: 860
 Winnings: 737020
Hand: 47777, Bid: 533, Hand Type: 6, Rank: 861
 Winnings: 458913
Hand: 48888, Bid: 97, Hand Type: 6, Rank: 862
 Winnings: 83614
Hand: 4KKKK, Bid: 865, Hand Type: 6, Rank: 863
 Winnings: 746495
Hand: 4A444, Bid: 153, Hand Type: 6, Rank: 864
 Winnings: 132192
Hand: 5J558, Bid: 430, Hand Type: 6, Rank: 865
 Winnings: 371950
Hand: 52J22, Bid: 835, Hand Type: 6, Rank: 866
 Winnings: 723110
Hand: 52222, Bid: 154, Hand Type: 6, Rank: 867
 Winnings: 133518
Hand: 55552, Bid: 39, Hand Type: 6, Rank: 868
 Winnings: 33852
Hand: 55559, Bid: 232, Hand Type: 6, Rank: 869
 Winnings: 201608
Hand: 555T5, Bid: 98, Hand Type: 6, Rank: 870
 Winnings: 85260
Hand: 55KJ5, Bid: 130, Hand Type: 6, Rank: 871
 Winnings: 113230
Hand: 55A55, Bid: 424, Hand Type: 6, Rank: 872
 Winnings: 369728
Hand: 5777J, Bid: 178, Hand Type: 6, Rank: 873
 Winnings: 155394
Hand: 58555, Bid: 912, Hand Type: 6, Rank: 874
 Winnings: 797088
Hand: 5KKKK, Bid: 945, Hand Type: 6, Rank: 875
 Winnings: 826875
Hand: 6J626, Bid: 666, Hand Type: 6, Rank: 876
 Winnings: 583416
Hand: 63333, Bid: 418, Hand Type: 6, Rank: 877
 Winnings: 366586
Hand: 64666, Bid: 375, Hand Type: 6, Rank: 878
 Winnings: 329250
Hand: 65666, Bid: 182, Hand Type: 6, Rank: 879
 Winnings: 159978
Hand: 66626, Bid: 613, Hand Type: 6, Rank: 880
 Winnings: 539440
Hand: 6668J, Bid: 621, Hand Type: 6, Rank: 881
 Winnings: 547101
Hand: 666T6, Bid: 870, Hand Type: 6, Rank: 882
 Winnings: 767340
Hand: 666K6, Bid: 402, Hand Type: 6, Rank: 883
 Winnings: 354966
Hand: 66766, Bid: 223, Hand Type: 6, Rank: 884
 Winnings: 197132
Hand: 67777, Bid: 897, Hand Type: 6, Rank: 885
 Winnings: 793845
Hand: 6K6J6, Bid: 767, Hand Type: 6, Rank: 886
 Winnings: 679562
Hand: 7J7T7, Bid: 809, Hand Type: 6, Rank: 887
 Winnings: 717583
Hand: 73777, Bid: 82, Hand Type: 6, Rank: 888
 Winnings: 72816
Hand: 74J4J, Bid: 274, Hand Type: 6, Rank: 889
 Winnings: 243586
Hand: 74444, Bid: 437, Hand Type: 6, Rank: 890
 Winnings: 388930
Hand: 755J5, Bid: 510, Hand Type: 6, Rank: 891
 Winnings: 454410
Hand: 75555, Bid: 477, Hand Type: 6, Rank: 892
 Winnings: 425484
Hand: 75777, Bid: 461, Hand Type: 6, Rank: 893
 Winnings: 411673
Hand: 77772, Bid: 284, Hand Type: 6, Rank: 894
 Winnings: 253896
Hand: 777T7, Bid: 846, Hand Type: 6, Rank: 895
 Winnings: 757170
Hand: 77977, Bid: 678, Hand Type: 6, Rank: 896
 Winnings: 607488
Hand: 79999, Bid: 828, Hand Type: 6, Rank: 897
 Winnings: 742716
Hand: 7K777, Bid: 944, Hand Type: 6, Rank: 898
 Winnings: 847712
Hand: 7A777, Bid: 861, Hand Type: 6, Rank: 899
 Winnings: 774039
Hand: 8JAJA, Bid: 663, Hand Type: 6, Rank: 900
 Winnings: 596700
Hand: 858J8, Bid: 781, Hand Type: 6, Rank: 901
 Winnings: 703681
Hand: 86666, Bid: 242, Hand Type: 6, Rank: 902
 Winnings: 218284
Hand: 88JJ7, Bid: 588, Hand Type: 6, Rank: 903
 Winnings: 530964
Hand: 88388, Bid: 969, Hand Type: 6, Rank: 904
 Winnings: 875976
Hand: 88688, Bid: 108, Hand Type: 6, Rank: 905
 Winnings: 97740
Hand: 88788, Bid: 763, Hand Type: 6, Rank: 906
 Winnings: 691278
Hand: 888K8, Bid: 265, Hand Type: 6, Rank: 907
 Winnings: 240355
Hand: 8T888, Bid: 202, Hand Type: 6, Rank: 908
 Winnings: 183416
Hand: 8TTTT, Bid: 398, Hand Type: 6, Rank: 909
 Winnings: 361782
Hand: 8Q888, Bid: 140, Hand Type: 6, Rank: 910
 Winnings: 127400
Hand: 8KKKK, Bid: 167, Hand Type: 6, Rank: 911
 Winnings: 152137
Hand: 9JT99, Bid: 954, Hand Type: 6, Rank: 912
 Winnings: 870048
Hand: 9JQ9J, Bid: 731, Hand Type: 6, Rank: 913
 Winnings: 667403
Hand: 9399J, Bid: 858, Hand Type: 6, Rank: 914
 Winnings: 784212
Hand: 979J9, Bid: 827, Hand Type: 6, Rank: 915
 Winnings: 756705
Hand: 98888, Bid: 65, Hand Type: 6, Rank: 916
 Winnings: 59540
Hand: 99J29, Bid: 595, Hand Type: 6, Rank: 917
 Winnings: 545615
Hand: 99J59, Bid: 901, Hand Type: 6, Rank: 918
 Winnings: 827118
Hand: 99J94, Bid: 843, Hand Type: 6, Rank: 919
 Winnings: 774717
Hand: 99299, Bid: 312, Hand Type: 6, Rank: 920
 Winnings: 287040
Hand: 9998J, Bid: 246, Hand Type: 6, Rank: 921
 Winnings: 226566
Hand: 99989, Bid: 839, Hand Type: 6, Rank: 922
 Winnings: 773558
Hand: 99996, Bid: 323, Hand Type: 6, Rank: 923
 Winnings: 298129
Hand: 999T9, Bid: 511, Hand Type: 6, Rank: 924
 Winnings: 472164
Hand: 999A9, Bid: 800, Hand Type: 6, Rank: 925
 Winnings: 740000
Hand: 9TTTT, Bid: 412, Hand Type: 6, Rank: 926
 Winnings: 381512
Hand: TJ44J, Bid: 448, Hand Type: 6, Rank: 927
 Winnings: 415296
Hand: TJTJQ, Bid: 738, Hand Type: 6, Rank: 928
 Winnings: 684864
Hand: T2222, Bid: 51, Hand Type: 6, Rank: 929
 Winnings: 47379
Hand: TTJAJ, Bid: 317, Hand Type: 6, Rank: 930
 Winnings: 294810
Hand: TT5TT, Bid: 239, Hand Type: 6, Rank: 931
 Winnings: 222509
Hand: TTT4T, Bid: 422, Hand Type: 6, Rank: 932
 Winnings: 393304
Hand: TTTT3, Bid: 363, Hand Type: 6, Rank: 933
 Winnings: 338679
Hand: TTTT6, Bid: 752, Hand Type: 6, Rank: 934
 Winnings: 702368
Hand: TTTTK, Bid: 740, Hand Type: 6, Rank: 935
 Winnings: 691900
Hand: TTTQT, Bid: 103, Hand Type: 6, Rank: 936
 Winnings: 96408
Hand: QJ777, Bid: 136, Hand Type: 6, Rank: 937
 Winnings: 127432
Hand: QJ9QQ, Bid: 949, Hand Type: 6, Rank: 938
 Winnings: 890162
Hand: Q3333, Bid: 372, Hand Type: 6, Rank: 939
 Winnings: 349308
Hand: Q4444, Bid: 904, Hand Type: 6, Rank: 940
 Winnings: 849760
Hand: QQJQ6, Bid: 37, Hand Type: 6, Rank: 941
 Winnings: 34817
Hand: QQQ5Q, Bid: 943, Hand Type: 6, Rank: 942
 Winnings: 888306
Hand: QQQQ3, Bid: 903, Hand Type: 6, Rank: 943
 Winnings: 851529
Hand: QQQQ4, Bid: 694, Hand Type: 6, Rank: 944
 Winnings: 655136
Hand: QQQQ8, Bid: 778, Hand Type: 6, Rank: 945
 Winnings: 735210
Hand: QQQQ9, Bid: 504, Hand Type: 6, Rank: 946
 Winnings: 476784
Hand: QQAQQ, Bid: 11, Hand Type: 6, Rank: 947
 Winnings: 10417
Hand: KJKK9, Bid: 189, Hand Type: 6, Rank: 948
 Winnings: 179172
Hand: K6JJJ, Bid: 216, Hand Type: 6, Rank: 949
 Winnings: 204984
Hand: KTJJJ, Bid: 294, Hand Type: 6, Rank: 950
 Winnings: 279300
Hand: KTKKK, Bid: 60, Hand Type: 6, Rank: 951
 Winnings: 57060
Hand: KKJ2K, Bid: 410, Hand Type: 6, Rank: 952
 Winnings: 390320
Hand: KKJAK, Bid: 833, Hand Type: 6, Rank: 953
 Winnings: 793849
Hand: KK7JK, Bid: 433, Hand Type: 6, Rank: 954
 Winnings: 413082
Hand: KKK5J, Bid: 734, Hand Type: 6, Rank: 955
 Winnings: 700970
Hand: KKK6J, Bid: 719, Hand Type: 6, Rank: 956
 Winnings: 687364
Hand: KKKK6, Bid: 158, Hand Type: 6, Rank: 957
 Winnings: 151206
Hand: KKKK9, Bid: 475, Hand Type: 6, Rank: 958
 Winnings: 455050
Hand: KKKAK, Bid: 303, Hand Type: 6, Rank: 959
 Winnings: 290577
Hand: AJ6AA, Bid: 893, Hand Type: 6, Rank: 960
 Winnings: 857280
Hand: AJ7AA, Bid: 121, Hand Type: 6, Rank: 961
 Winnings: 116281
Hand: AJA5J, Bid: 789, Hand Type: 6, Rank: 962
 Winnings: 759018
Hand: A4AAA, Bid: 787, Hand Type: 6, Rank: 963
 Winnings: 757881
Hand: A6666, Bid: 725, Hand Type: 6, Rank: 964
 Winnings: 698900
Hand: A6AAA, Bid: 631, Hand Type: 6, Rank: 965
 Winnings: 608915
Hand: A8888, Bid: 896, Hand Type: 6, Rank: 966
 Winnings: 865536
Hand: ATTTT, Bid: 878, Hand Type: 6, Rank: 967
 Winnings: 849026
Hand: AKAAA, Bid: 931, Hand Type: 6, Rank: 968
 Winnings: 901208
Hand: AAA7A, Bid: 32, Hand Type: 6, Rank: 969
 Winnings: 31008
Hand: AAATA, Bid: 293, Hand Type: 6, Rank: 970
 Winnings: 284210
Hand: AAAA8, Bid: 263, Hand Type: 6, Rank: 971
 Winnings: 255373
Hand: JJJJJ, Bid: 900, Hand Type: 7, Rank: 972
 Winnings: 874800
Hand: JJ66J, Bid: 69, Hand Type: 7, Rank: 973
 Winnings: 67137
Hand: JJ8JJ, Bid: 951, Hand Type: 7, Rank: 974
 Winnings: 926274
Hand: JJQQQ, Bid: 436, Hand Type: 7, Rank: 975
 Winnings: 425100
Hand: J2J22, Bid: 331, Hand Type: 7, Rank: 976
 Winnings: 323056
Hand: J5555, Bid: 14, Hand Type: 7, Rank: 977
 Winnings: 13678
Hand: J66J6, Bid: 308, Hand Type: 7, Rank: 978
 Winnings: 301224
Hand: J8JJ8, Bid: 19, Hand Type: 7, Rank: 979
 Winnings: 18601
Hand: J8888, Bid: 822, Hand Type: 7, Rank: 980
 Winnings: 805560
Hand: JTTJT, Bid: 370, Hand Type: 7, Rank: 981
 Winnings: 362970
Hand: JAAJA, Bid: 993, Hand Type: 7, Rank: 982
 Winnings: 975126
Hand: 22J22, Bid: 775, Hand Type: 7, Rank: 983
 Winnings: 761825
Hand: 33J3J, Bid: 343, Hand Type: 7, Rank: 984
 Winnings: 337512
Hand: 33J33, Bid: 875, Hand Type: 7, Rank: 985
 Winnings: 861875
Hand: 4JJ44, Bid: 344, Hand Type: 7, Rank: 986
 Winnings: 339184
Hand: 4J444, Bid: 174, Hand Type: 7, Rank: 987
 Winnings: 171738
Hand: 5J5J5, Bid: 172, Hand Type: 7, Rank: 988
 Winnings: 169936
Hand: 55JJJ, Bid: 225, Hand Type: 7, Rank: 989
 Winnings: 222525
Hand: 6J666, Bid: 916, Hand Type: 7, Rank: 990
 Winnings: 906840
Hand: 77J7J, Bid: 259, Hand Type: 7, Rank: 991
 Winnings: 256669
Hand: 7777J, Bid: 126, Hand Type: 7, Rank: 992
 Winnings: 124992
Hand: 8JJ88, Bid: 874, Hand Type: 7, Rank: 993
 Winnings: 867882
Hand: 9J999, Bid: 980, Hand Type: 7, Rank: 994
 Winnings: 974120
Hand: 99JJ9, Bid: 564, Hand Type: 7, Rank: 995
 Winnings: 561180
Hand: TTTTJ, Bid: 384, Hand Type: 7, Rank: 996
 Winnings: 382464
Hand: QQQJQ, Bid: 253, Hand Type: 7, Rank: 997
 Winnings: 252241
Hand: KJKKK, Bid: 929, Hand Type: 7, Rank: 998
 Winnings: 927142
Hand: KKJKJ, Bid: 712, Hand Type: 7, Rank: 999
 Winnings: 711288
Hand: AAAJA, Bid: 936, Hand Type: 7, Rank: 1000
 Winnings: 936000
252898370
#+end_example

* Part 2

#+BEGIN_SRC python :results output :session part2
#Js are Jokers, yay



part2Bids = [camelHand(i.split(" ")) for i in puzzleInput]
part2Bids.sort()

print(calcWinnings(part2Bids))
#+END_SRC

#+RESULTS:
#+begin_example
Hand: 32T3K, Bid: 765, Hand Type: 2, Rank: 1
 Winnings: 765
Hand: KK677, Bid: 28, Hand Type: 3, Rank: 2
 Winnings: 56
Hand: T55J5, Bid: 684, Hand Type: 6, Rank: 3
 Winnings: 2052
Hand: QQQJA, Bid: 483, Hand Type: 6, Rank: 4
 Winnings: 1932
Hand: KTJJT, Bid: 220, Hand Type: 6, Rank: 5
 Winnings: 1100
5905
#+end_example
